import type { MethodGenerationData, QuizQuestion } from "./models";

export const MethodTestData = {
  discipline: "Обʼєктно-орієнтоване програмування",
  authors: ["Хрущак Сергій Вікторович"],
  disciplineQuestions: [
    "Що таке інверсія керування (IoC) у контексті розробки програмного забезпечення?",
    "Які проблеми виникають через сильну зв’язаність між класами?",
    "Як принцип інверсії керування допомагає зменшити зв’язаність між компонентами?",
    "Що таке ін’єкція залежностей (Dependency Injection, DI)?",
    "Які основні типи ін’єкції залежностей існують?",
    "Що таке інверсія керування (IoC) у контексті розробки програмного забезпечення?",
    "Які проблеми виникають через сильну зв’язаність між класами?",
    "Як принцип інверсії керування допомагає зменшити зв’язаність між компонентами?",
    "Що таке ін’єкція залежностей (Dependency Injection, DI)?",
    "Які основні типи ін’єкції залежностей існують?"
  ],
  topics: [
    {
      title: "Тестовий урок",
      index: 1,
      keywords: ["Inversion of Control", "IoC", "Dependency Injection", "DI", "C#", "coupling"],
      selfQuestions: [
        "Порівняння IoC та DI з іншими патернами проектування, такими як Factory та Service Locator.",
        "Історія розвитку IoC та DI: як ці концепції еволюціонували в програмуванні.",
        "Вплив IoC та DI на архітектуру мікросервісів.",
        "Роль IoC та DI у забезпеченні принципів SOLID, окрім Dependency Inversion Principle.",
        "Порівняння різних IoC контейнерів: переваги та недоліки кожного.",
        "Використання IoC та DI у тестуванні: підходи та інструменти."
      ],
      referats: [
        "Вступ до інверсії керування (IoC) та ін’єкції залежностей (DI) в C#",
        "Проблема сильної зв’язаності в об’єктно-орієнтованому програмуванні",
        "Принцип інверсії керування (IoC) та його реалізація в C#",
        "Типи ін’єкції залежностей: конструктор, властивість, метод",
        "Переваги використання ін’єкції залежностей у C#"
      ],
      quiz: [
        {
          "index": 1,
          "question": "Що таке інверсія керування (IoC) в контексті ООП?",                
          "option1": "Процес, коли об'єкт сам створює свої залежності",
          "option2": "Процес, коли об'єкт отримує залежності ззовні",
          "option3": "Процес, коли об'єкт не має жодних залежностей",
          "option4": "Процес, коли об'єкт створює залежності для інших об'єктів"
      
        },
        {
          "index": 2,
          "question": "Яка з наведених реалізацій є прикладом ін’єкції залежностей через конструктор?",
          "option1": "public void Notify(string message, IMessageService service)",
          "option2": "public IMessageService MessageService { get; set; }",
          "option3": "public NotificationManager(IMessageService messageService)",
          "option4": "public void SendEmail(string message)"
        }
      ] as QuizQuestion[],
      keyQuestions: [
        "Що таке інверсія керування (IoC) у контексті розробки програмного забезпечення?",
        "Які проблеми виникають через сильну зв’язаність між класами?",
        "Як принцип інверсії керування допомагає зменшити зв’язаність між компонентами?",
        "Що таке ін’єкція залежностей (Dependency Injection, DI)?",
        "Які основні типи ін’єкції залежностей існують?"
      ]
    },
    {
      title: "Другий тестовий урок",
      index: 2,
      keywords: ["Dependency Injection", "DI", "C#", "coupling"],
      selfQuestions: [
        "Роль IoC та DI у забезпеченні принципів SOLID, окрім Dependency Inversion Principle.",
        "Порівняння різних IoC контейнерів: переваги та недоліки кожного.",
        "Використання IoC та DI у тестуванні: підходи та інструменти.",
        "Порівняння IoC та DI з іншими патернами проектування, такими як Factory та Service Locator.",
        "Історія розвитку IoC та DI: як ці концепції еволюціонували в програмуванні.",
        "Вплив IoC та DI на архітектуру мікросервісів."                
      ],
      referats: [
        "Вступ до інверсії керування (IoC) та ін’єкції залежностей (DI) в C#",
        "Проблема сильної зв’язаності в об’єктно-орієнтованому програмуванні",
        "Принцип інверсії керування (IoC) та його реалізація в C#",
        "Типи ін’єкції залежностей: конструктор, властивість, метод",
        "Переваги використання ін’єкції залежностей у C#"
      ],
      quiz: [
        {
          "index": 1,
          "question": "Що таке інверсія керування (IoC) в контексті ООП?",                
          "option1": "Процес, коли об'єкт сам створює свої залежності",
          "option2": "Процес, коли об'єкт отримує залежності ззовні",
          "option3": "Процес, коли об'єкт не має жодних залежностей",
          "option4": "Процес, коли об'єкт створює залежності для інших об'єктів"
      
        },
        {
          "index": 2,
          "question": "Яка з наведених реалізацій є прикладом ін’єкції залежностей через конструктор?",
          "option1": "public void Notify(string message, IMessageService service)",
          "option2": "public IMessageService MessageService { get; set; }",
          "option3": "public NotificationManager(IMessageService messageService)",
          "option4": "public void SendEmail(string message)"
        }
      ] as QuizQuestion[],
      keyQuestions: [
        "Що таке інверсія керування (IoC) у контексті розробки програмного забезпечення?",
        "Які проблеми виникають через сильну зв’язаність між класами?",
        "Як принцип інверсії керування допомагає зменшити зв’язаність між компонентами?",
        "Що таке ін’єкція залежностей (Dependency Injection, DI)?",
        "Які основні типи ін’єкції залежностей існують?"
      ]
    }
  ]
} as MethodGenerationData;