{
  course: {
    id: 2,
    name: "Програмування мобільних додатків",
    teacher_id: 1,
    data: {
      area: "Компʼютерні науки",
      hours: "90",
      credits: "3",
      results: [],
      specialty: "122 – Компʼютерні науки",
      description: "",
      prerequisites: [],
      postrequisites: [],
    },
    created_at: 2025-11-03T17:02:01.172Z,
    updated_at: 2025-11-04T11:52:20.990Z,
    generated: {
      disciplineQuestions: [
        "Які основні платформи для мобільних додатків існують?",
        "Яка частка ринку у Android та iOS?", "Які інші платформи для мобільних додатків майже не використовуються?",
        "Коли з'явився Android і на якому ядрі він заснований?",
        "Яка відкрита версія Android і хто її просуває?",
        "На яких мовах в основному розробляються додатки для Android?",
        "Яка архітектура Android і яке основне середовище виконання?",
        "Як виконуються додатки в Android?", "Коли вийшла iOS і на якому ядрі вона базується?",
        "На яких мовах розробляються додатки для iOS?",
        "Яка архітектура iOS і яке основне API?",
        "Які додаткові пакети є в iOS?", "Які особливості інтерфейсу мобільних додатків?",
        "Які обмеження існують для мобільних додатків?",
        "Які нові апаратні можливості є у мобільних пристроїв?",
        "Який найпопулярніший фреймворк для мультиплатформенної розробки?",
        "Які мови використовуються для мультиплатформенної розробки?",
        "Які платформи підтримуються мультиплатформенними фреймворками?",
        "Які особливості має Flutter у мультиплатформенній розробці?",
        "Які відмінності в синтаксисі між Java та C#?",
        "Що таке Activity в контексті розробки мобільних додатків на Android?",
        "Яка роль класу Activity в Android додатках?",
        "Які основні стани може проходити Activity протягом свого життєвого циклу?",
        "Яка функція методу onCreate() в життєвому циклі Activity?",
        "Що відбувається під час виклику методу onStart() в Activity?",
        "Яка різниця між методами onResume() та onPause() в життєвому циклі Activity?",
        "Коли викликається метод onStop() і яка його основна функція?",
        "Що відбувається під час виклику методу onRestart() в Activity?",
        "Яка роль методу onDestroy() в життєвому циклі Activity?",
        "Що таке View в контексті Android додатків?",
        "Яка роль ViewGroup в розміщенні компонентів інтерфейсу?",
        "Як працює LinearLayout і які його основні властивості?",
        "Яка різниця між LinearLayout та TableLayout?",
        "Що таке ConstraintLayout і чому він вважається найпродвинутішим?",
        "Як розміщення компонентів може адаптуватися до різних розмірів екранів?",
        "Що таке DPI і як він впливає на розміри елементів інтерфейсу?",
        "Як вимірюються розміри в Android і чому використовуються dp?",
        "Що таке SP і як він відрізняється від dp?",
        "Які переваги використання XML для визначення розміщення компонентів?",
        "Як Jetpack Compose може бути використаний для визначення інтерфейсу в Android?",
        "Як отримати доступ до елемента інтерфейсу в Activity?",
        "Який метод використовується для отримання ідентифікаторів елементів інтерфейсу?",
        "Як викликати методи, специфічні для кнопки, після отримання її через findViewById?",
        "Який метод використовується для додавання обробника подій на кнопку?",
        "Як можна переглянути реалізацію методу в Android Studio?",
        "Чому лямбда-вирази не підходять для обробки подій текстових полів?",
        "Який інтерфейс потрібно реалізувати для обробки подій текстових полів?",
        "Які методи потрібно реалізувати при використанні TextWatcher?",
        "Який клас використовується для логування в Android?",
        "Які рівні логування доступні в класі Log?",
        "Як увімкнути автоматичне зв'язування компонентів у проекті?",
        "Який клас генерується для кожного layout при використанні viewBinding?",
        "Як підключити згенерований клас binding в активності?",
        "Чому стан додатку втрачається при зміні конфігурації?",
        "Як зберігати налаштування додатку в Android?",
        "Що таке MVVM і які його основні компоненти?",
        "Як встановити двосторонній зв'язок між даними та відображенням?",
        "Як реалізувати підписку на зміни в моделі?",
        "Який клас зазвичай містить поточний стан екрану в архітектурі MVVM?",
        "Як отримати ViewModel в onCreate() активності?",
        "Що таке активність в контексті розробки Android додатків?",
        "Як створити нову активність в Android додатку?",
        "Яка роль класу Intent в Android?", "Чим відрізняються явні та неявні Intent в Android?",
        "Як передати дані між активностями за допомогою Intent?",
        "Як запустити сторонню активність за допомогою неявного Intent?",
        "Які проблеми виникають при використанні окремих активностей в Android додатках?",
        "Що таке фрагмент в Android?", "Як фрагменти допомагають в організації інтерфейсу додатків?",
        "Як створити новий фрагмент в Android Studio?",
        "Як організувати навігацію між фрагментами в Android додатку?",
        "Що таке FragmentManager і як він використовується?",
        "Як реалізувати перехід між фрагментами при виборі пункту меню?",
        "Що таке сервіс в Android і для чого він використовується?",
        "Як створити та зареєструвати сервіс в Android додатку?",
        "Як запустити сервіс в Android?", "Яка різниця між background та foreground сервісами?",
        "Як працює система прав доступу в Android додатках?",
        "Як запитати дозвіл на доступ до камери в Android додатку?",
        "Які проблеми можуть виникнути при передачі даних між активностями?",
        "Що таке стек екранів у контексті навігації в додатках?",
        "Які основні компоненти навігації в Android?",
        "Яка роль NavHost у навігації?", "Що таке NavGraph і для чого він використовується?",
        "Яка функція NavController у навігації?",
        "Що таке Destination у контексті навігації?",
        "Як можна візуально організувати переходи між фрагментами?",
        "Які переваги використання навігаційного контролера в Android?",
        "Як можна задати анімацію для переходів між екранами?",
        "Що таке deep linking у контексті навігації?",
        "Як створити navigation graph у Android Studio?",
        "Яка роль фрагментів у навігації додатків?",
        "Як налаштувати NavHostFragment у головній активності?",
        "Які кроки необхідні для організації переходів у коді?",
        "Як можна використовувати Navigation.findNavController(view) у коді?",
        "Яка роль Toolbar у навігації додатків?",
        "Як налаштувати Toolbar для роботи з навігаційним контролером?",
        "Що таке Navigation Drawer і як він реалізується?",
        "Яка структура XML для реалізації Navigation Drawer?",
        "Як можна додати меню в Toolbar у Android додатках?",
        ... 120 more items
      ],
    },
    teacher: "Хрущак Сергій Вікторович",
  },
  topics: [
    {
      id: 1,
      course_id: 2,
      lection: "Особливості розробки мобільних додатків\n\nОсновні платформи для мобільних додатків\nAndroid (70%)\niOS (30%)\nТакож є й інші, які, однак, майже не використовуються:\nHarmony OS (Android від Huawei)\nWindows Mobile \nBlackberry OS\nSymbian OS\nTizen (Samsung)\n\nAndroid\nЗʼявився в 2008 році (розробка почалась з 2003)\nЗаснований на ядрі Linux\nВідкрита версія називається AOSP (Android Open Source Project) й продвигається Open Handset Alliance, головує в якому Google\nДодатки в основному розробляються на мовах Kotlin та Java, частини на C++\n\n\nАрхітектура Android\nБазується на Linux ядрі\nОсновне середовище виконання та API – віртуальна машина Java – ART (раніше Dalvik)\nДодатки компілюються в Java байт код та виконуються в ART\nЗалишається можливість створювати також додатки на C++ (або швидше частини додатків)\nДодатки виконуються в пісочниці (Sandbox) – в кожного додатку свій користувач в лінукс\n\niOS\nВийшла в 2007 році\nВстановлювати окремі додатки стало можливим в 2008 році\nБазується на ядрі XNU (BSD), таке саме як в macOS\nДодатки розробляються на Swift / Objective C (deprecated) й компілюються в нативний код ARM\nНативна розробка тільки на macOS\n\nАрхітектура iOS\nAPI iOS та macOS бере свій початок з системи NeXTSTEP, тому багато класів навіть мали префікс NSString, який в пізніших версіях Swift прибрали.\n\nОсновне API в iOS називається Сocoa Touch й складається з AppKit (набір класів для роботи з інтерфейсом).\n\nТакож є додаткові пакети:\nCore Data – інтерфейс для роботи з БД / xml\nFoundation – основні класи, структури типу Array, Set, Dictionary\n\nДодатки компілюються в ARM байт код та  виконуються в пісочниці (Sandbox).\n \n\nОсобливості мобільної розробки\nІнтерфейс: компоненти відмінні від настільних додатків та більш заточені під touch екрани\nІнший підхід до мультитаскінгу\nОбмеження памʼяті\nБільш суворий підхід до безпеки: Sandboxing (пісочниця) та обмеження доступу, шифрування, Trusted Execution Environment (апаратна ізоляція), підписування додатків\nОбмежене використання фонових ресурсів для збільшення автономності\nНові апаратні можливості: GPS, акселерометр, камера, bluetooth, телефонія, LTE\n\n\nМультиплатформенна розробка\n\nМультиплатформенна розробка\nСамий популярний фреймворк для розробки мультиплатформенних додатків\nПідтримує взаємодію з нативними компонентами системи\nПідтримує розробку під Desktop/iOS/Android \nВикористовує мову Dart\nПідтримується Google\nFlutter сам відмальовує всі компоненти, тобто додаток для ОС є просто пустим вікном, тому вигляд буде дещо відрізнятись від нативних додатків\n\nМультиплатформенна розробка\nБазується на React.js\nПідтримка iOS, Android, Web\nВикористовує Javascript / Typescript\nПідтримує нативні компоненти та компіляцію в нативний код платформи\nРозвивається компанією Meta (Facebook)\nДеякі частини коду необхідно змінювати під конкретну платформу\nЄ дещо повільнішим за нативні додатки\n\nМультиплатформенна розробка\nВикористовує Javascript, HTML, CSS\nПідтримує популярні веб фремворки Angular, Vue, Svelte\nФактично дозволяє викликати нативний код операційної системи з Javascript, різний для різних платформ\nМає дещо меншу швидкодію ніж нативні додатки\n\nМультиплатформенна розробка\nПідтримка iOS, Android, Windows, Web, Desktop\nВикористовує HTML, CSS, Javascript/Typescript\nМожна використовувати популярні Javascript фремворки React, Angular чи Vue\nЄдиний код для всіх платформ\nДозволяє будувати гібридні додатки (по факту web, який виглядає як нативний додаток)\nЄ повільнішим за нативні додатки\n\nМультиплатформенна розробка\nMulti-platform App UI\nЗаміна популярного фремворку Xamarin\nПідтримує iOS, Android, macOS, Linux та Windows\nРозвивається Microsoft\nМова програмування C# та XAML\nРендериться в нативні компоненти системи\nКод для платформ не єдиний, а спільний\n\nAndroid\nВ основному на курсі будемо розглядати розробку під Android на мові Java.\nДля розробки використовуватимемо Android Studio від Google.\nДля побудови інтерфейсу – використовуватимемо XML.\n\n\nAndroid Studio\n\nJava\nВ цілому синтаксис мови Java походить від C, тому вона схожа на C#, однак має деякі відмінності, далі буде наведено основні синтаксичні відмінності між мовами.\nНаприклад виведення стрічки:\n\nІмпортування залежностей\n\nFor each\nЄ невеликі відмінності в описі циклів for each:\nJava:\nC#:\n\nВідмінності в обʼявленні класів\nЗамість двокрапки в Java використовують слово extends для класів, чи implements для інтерфейсів.\nТакож починати інтерфейси з I прийнято тільки в C#.\nВ Java вимагається кожен публічний клас описувати в окремому файлі з назвою класу: B.java\nЗамість namespace → package, й package повинні повторювати структуру папок. Класи які знаходяться в пакеті\npackage test;\nМають знаходитись в папці test/.\n\nТипи\nВ Java всі примітивні типи мають знак за замовчуванням, тоді як в C# існують по 2 версії типів: int / uint, long / ulong і т.д. \nМасиви декларуються схожим чином:\nJava:\nC#:\n\nПоліморфізм\nВ Java всі методи є віртуальними, тому ключового слова virtual немає.\nС#\nJava\n\nProperties\nProperties відстутні в Java, замість них просто використовують методи get/set:\nJava:\nC#:\n\nJava\nC#",
      generated: [Object ...],
      created_at: 2025-11-03T20:47:07.525Z,
      updated_at: 2025-11-04T20:25:51.247Z,
      index: 1,
      name: "Архітектури мобільних систем",
    }, {
      id: 2,
      course_id: 2,
      lection: "Особливості розробки мобільних додатків\n\nActivity\nОскільки робота з мобільними додатками дещо відрізняється від десктопу й часто починається з різних місць, то в Андроїд додатках немає звичного main() методу, з якого починається робота додатку.\nНатомість в якості точки входу в програму використовується клас Activity. Таких точок входу може бути багато в залежності від контексту виклику. \nЇї можна розглядати як вікно (екран) програми, в якому відображається інтерфейс, а сама програма може складатись з декількох таких екранів.\nЗазвичай одна з активностей є головною, це та, яка запускається з головного екрану.\n\nСтани Активності\nПротягом свого життя діяльність проходить ряд станів. Ви, як розробник, можете реалізовувати методи, що оброблятимуть переходи між станами. Наприклад, зупинити програвання аудіо/відео, зберегти стан, перестати використовувати камеру, тощо.\n\nЗ обовʼязкових є тільки onCreate() – метод, що визивається при створенні активності й повинен ініціалізовувати основні її компоненти.\n\nonStart() – активність стає видимою\nonResume() – активність вже може обробляти користувацьке введення\nonPause() – активність втратила фокус (користувач натис “Назад” чи недавні додатки, однак ще видима\nonStop() – активність більше не видима, використовується щоб зберегти стан\nonRestart() – користувач повернувся в активність \nonDestroy() – активність повністю знищується\n\nОсновні компоненти Андроїд додатків\nВсі компоненти наслідуються від типу View, які ще називають widget.\nhttps://m3.material.io/components\n\nПроблема інтерфейсів для мобільних пристроїв\n\nВирішення в Андроїд 1 - Розміщення (Layouts)\nЗамість прямого вказання координат кожного компоненту, всі вони групуються в невидимі контейнери ViewGroup. Самі розміщення можуть бути всередині інших розміщень (схоже як в HTML з div).\n\nLayout задають яким чином компоненти розміщуються всередині них, а також можуть задавати відступи між компонентами, чи ззовні. \n\nВирішення в Андроїд 2 – різні розміщення в залежності від екрану\nРозміщення компонентів, як і будь-який інший ресурс, може мати декілька окремих варіантів для різних параметрів пристрою.\n\nМожна задати один вигляд для малих екранів, інших для більших.\n\nLinearLayout\nРозміщує компоненти підряд по горизонталі чи вертикалі.\n\nLinearLayout\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\"\n              android:layout_width=\"match_parent\"\n              android:layout_height=\"match_parent\"\n              android:orientation=\"vertical\" >\n    <TextView android:id=\"@+id/text\"\n              android:layout_width=\"wrap_content\"\n              android:layout_height=\"wrap_content\"\n              android:text=\"Hello, I am a TextView\" />\n    <Button android:id=\"@+id/button\"\n            android:layout_width=\"wrap_content\"\n            android:layout_height=\"wrap_content\"\n            android:text=\"Hello, I am a Button\" />\n</LinearLayout>\nРозміщення зазвичай задаються в XML, для якого є зручний візуальний редактор. Однак можна також задавати й в коді чи через Jetpack Compose\n\nTableLayout\nРозміщує компоненти у вигляді таблиці.\n\nConstraintLayout\nНайпродвинутіший варіант розміщення, що частіше за все використовується за основу додатку.\nДозволяє задавати позицію компонентів у вигляді відносних відстаней до сусідніх.\nКомпоненти з таким розміщенням можуть змінювати свій розмір, не змінюючи при цьому відносних позицій.\n\nDPI\nОскільки пристрої мають різні екрани з різною кількістю точок на дюйм (dpi), розміри в Андроїд зазвичай вимірюють в dp – density independent pixels. \n1 dp = 1 піксель на екрані з dpi = 160\n1 dp = 2 пікселі на екрані з dpi = 360 і т.д.\nТому елементи мають однаковий розмір на екранах з великою кількістю точок на дюйм.\nДля написів використовують SP – scale independent pixels, це dp, які також масштабуються згідно налаштувань шрифта користвувачем.",
      generated: [Object ...],
      created_at: 2025-11-04T11:41:15.893Z,
      updated_at: 2025-11-04T20:26:13.309Z,
      index: 2,
      name: "Основні компоненти Android додатків",
    },
    {
      id: 3,
      course_id: 2,
      lection: "Обробка подій\n\nДоступ до елементів інтерфейсу\nДля доступу до елементів інтерфейсу в Activity є метод findViewById(id), який можна викликати після встановлення layout. Всі ідентифікатори можна отримати з обʼєкту R.id. Якщо ідентифікатор вашої кнопки mainButton, то доступитись до неї можна \nButton button = findViewById(R.id.mainButton)\nОднак цей метод повертає тип View – самий загальний для всіх компонентів, тому якщо необхідно використати методи які відносяться саме до кнопки доведеться вручну зробити приведення до типу (casting):\n((Button)findViewById(R.id.mainButton)).метод_кнопки\n\nОбробник подій\nТепер щоб додати обробник можна скористатись методом setOnClickListener, він має один аргумент – елемент, на якому був клік:\n\n\n\nsubmitButton.setOnClickListener(v -> {\n   обробка\n});\n\n💡 Якщо не зрозуміло, що саме передавати в функцію чи як вона працює, Ctrl+Click перейде на її реалізацію\n\nОбробка подій текстових полів\nЗ текстовими полями дещо складніше, лямбда вже не спрацює, оскільки обробник має реалізувати 3 методи, які обробляють різні етапи введення.\nОднак його можна створювати одразу й використовувати тільки необхідні методи.\n\nОбробка подій текстових полів (варіант 2)\nІнший варіант - реалізувати інтерфейс TextWatcher в самій активності:\npublic class MainActivity extends AppCompatActivity implements TextWatcher {\n\n   protected void onCreate(Bundle savedInstanceState) {\n…\nEditText editText = findViewById(R.id.editFirstName);\neditText.addTextChangedListener(this);\n…\n   }\n\n   @Override\n   public void beforeTextChanged(CharSequence s, int start, int count, int after) {\n\n   }\n\n   @Override\n   public void onTextChanged(CharSequence s, int start, int before, int count) {\n\n   }\n\n   @Override\n   public void afterTextChanged(Editable s) {\n\n   }\n}\n\nЛогування\npublic class MainActivity extends AppCompatActivity {\n   private static final String TAG = \"MainActivity\";\n\n   ...\n   \n\n   Log.i(TAG, \"Button clicked\");\n\n}\nДля логування створено клас Log з набором статичних методів:\nLog.d() - debug\nLog.i() - info\nLog.v() - verbose\nLog.w() - warning\nLog.e() - error\n\nКожен з цих методів приймає першим параметром тег (будь-яка стрічка) та саме повідомлення. Також опціонально передається виключення.\n\nАвтоматичне звʼязування компонентів\nОтримувати компоненти активності за ідентифікаторами не найбільш зручний варіант, тому існують опції автоматично звʼязування. Як це працює:\nВ build.gradle.kts необхідно додати наступне:\nandroid {\n   ...\n   buildFeatures {\n       viewBinding = true\n   }\n}\nВ результаті система збірки для кожного layout згенерує відповідний клас:\nactivity_main.xml ⇒ ActivityMainBinding\n\nПідключення згенерованого класу в активності\npublic class MainActivity extends AppCompatActivity {\n\n   private ActivityMainBinding binding;\n\n   protected void onCreate(Bundle savedInstanceState) {\n\t ...\n setContentView(R.layout.activity_main);\n       binding = ActivityMainBinding.inflate(getLayoutInflater());\n       setContentView(binding.getRoot());\n\t ...\n   }\n}\nДалі згенерований клас необхідно підключити в активності:\nТепер через об’єкт binding можна отримати доступ до всіх\nкомпонентів активності: binding.submitButton\n\nЗберігання стану активності\nОднак досі стан додатку втрачався при будь-якій зміні конфігурації. Тобто зміна орієнтації, світлої/темної теми, мови і т.д. призводить до втрати поточного стану додатку. \n\nЦе відбувається тому, що система Андроїд повністю перестворює активність, оскільки, можливо, активність має різні ресурси для різних конфігурацій. Тому всі дані в активності пропадають.\n\nЗберігання конфігурації\nSharedPreferences prefs = getSharedPreferences(\"app_preferences\", MODE_PRIVATE);\n\nboolean setting = prefs.getBoolean(\"test\", true);\n\nprefs.edit()\n   .putBoolean(\"test\", true)\n   .commit();\nSharedPreferences p = getPreferences(MODE_PRIVATE);\nВ андроїд є зручний засіб для зберігання налаштувань додатку:\nАбо ж налаштування локальні для активності:\nПри цьому автоматично створюється конфігураційний файл в папці додатку.\n\nMVVM\nModel – цей рівень представляє дані програми та бізнес логіку.\nView — відображення даних. Інформує ViewModel про дії користувача. Цей рівень не містить жодної логіки програми, однак слідкує за змінами в моделі.\nViewModel – Служить сполучною ланкою між моделлю та представленням. Зазвичай є преставленням одного екрану програми й часто дозволяє зберігати стан програми.\n\nМодель\npublic class Person {\n   private String name;\n   private String lastName;\n\n   public Person(String name, String lastName) {\n       this.name = name;\n       this.lastName = lastName;\n   }\n\n   public String getLastName() {\n       return lastName;\n   }\n\n   public void setLastName(String lastName) {\n       this.lastName = lastName;\n   }\n\n   public String getName() {\n       return name;\n   }\n\n   public void setName(String name) {\n       this.name = name;\n   }\n}\nСпочатку створимо модель, яка описуватиме дані, що відображені на екрані.\n\nОсновна ідея звʼязування\nМодель\n\nPerson {\n  String name;\n  String lastName;\n  boolean hasPassport;\n  void clear();\n}\nВідображення\nHas passport\nClear\nЗвʼязування дозволяє встановити одно чи двосторонній звʼязок між даними та компонентами відображення, так що зміни на компоненті автоматично передаватимуться в модель і навпаки, зміни в моделі змінюватимуть стан компонентів.\n\nЗміни для використання моделей\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<layout xmlns:android=\"http://schemas.android.com/apk/res/android\">\n   <data>\n       <variable name=\"person\" type=\"com.myapp.models.Person\"/>\n   </data>\n\n   Попередній код    \n\n</layout>\nandroid {\n    ...\n    buildFeatures {\n        dataBinding = true\n    }\n}\nВ файлі збірки:\nВ файлі розміщення:\n\nЗміни в коді\nsetContentView(R.layout.activity_main);\nActivityMainBinding binding = DataBindingUtil.setContentView(this, R.layout.activity_main);\nperson = new Person(\"Ryan\", \"Macksmith\");\nbinding.setPerson(person);\nЗміни в методі onCreate(), аналогічні попереднім, тільки метод setContentView автоматично встановлює розміщення, й binding тепер дозволяє передати модель в layout:\n\nВикористання змінних \nПісля чого можливо в layout доступатись до полів зв’язаних обʼєктів:\n<EditText\n   android:id=\"@+id/editFirstName\"\n   …   \n   android:text=\"@{person.name}\"\n/>\n<EditText\n   android:id=\"@+id/editFirstName\"\n   …   \n   android:text=\"@={person.passport}\"\n   android:visibility=\"@{person.age > 16 ? View.GONE : View.VISIBLE}\"\n/>\nДоступ тільки для читання\nМожливий доступ також на запис (див. =), або ж вирази можна використовувати в умовах\n\nВиклик функцій моделі з UI\n<Button\n   android:id=\"@+id/btnSubmit\"\n   …\n   android:onClick=\"@{(v) -> user.clear()}\"/>\nМожливо також викликати функції, наприклад при натисненні кнопки викликати метод user.clear():\nВсі доступні вирази можна проглянути в документації:\nhttps://developer.android.com/topic/libraries/data-binding/expressions#java\n\nДвосторонній звʼязок між даними та відображенням\nМодель\n\nPerson {\n  String name;\n  String lastName;\n  boolean hasPassport;\n  void clear();\n}\nВідображення\nHas passport\nClear\nПоки, що звʼязок між даними та відображенням є одностороннім, View може викликати методи setXX() в моделі, однак не оновлюватиме елементи керування, якщо дані змінились. Це відбувається тому, що немає ніякого механізму для повідомлення відображення що дані змінились (а запускати цикл, який би постійно порівнював чи нічого не змінилось в моделі неефективно). Тому потрібен механізм підписок: відображення підписується на події моделі, а модель повідомляє всіх підписників про зміни:\nПідписка\n\naddListener(this)\nПоле name змінилось\nnotifyPropertyChanged\n\nДвосторонній звʼязок між даними та відображенням\npublic class Person extends BaseObservable {\n\n   @Bindable\n   public String getLastName() {\n       return lastName;\n   }\n\n   public void setLastName(String lastName) {\n       this.lastName = lastName;\n       notifyPropertyChanged(BR.lastName);\n   }\n }\n\nДозволяє відправляти нотифікації при зміні полів, щоб відображення могло оновити екран.\nГенерує ідентифікатор BR.lastName \nНотифікація всіх підписників на модель що поле lastName оновилось\nПідписка при цьому відбувається автоматично, достатньо того, що модель реалізує інтерфейс Observable.\n\nViewModel\nЦе клас, який зазвичай містить поточний стан екрану та повʼязані з ним дані. \n\nБібліотека дозволяє автоматично керувати станом моделей, так що вони будуть відновлені при перестворенні активності.\n\nСтворення моделі екрану\npublic class MainScreen extends ViewModel {\n   private Person person = new Person(\"Test\", \"Test\");\n\n   public Person getPerson() {\n       return user;\n   }\n}\nЗавернемо нашу модель в інший клас, який міститиме всі дані екрану й наслідуватиметься від ViewModel:\nscreen = new ViewModelProvider(this).get(MainScreen.class);\nbinding.setUser(screen.getUser());\nДалі в onCreate() активності її можна отримати наступним чином:\nВ такому разі система сама буде створювати чи завантажувати модель в залежності від стану активності.",
      generated: [Object ...],
      created_at: 2025-11-04T11:44:33.804Z,
      updated_at: 2025-11-04T20:27:01.111Z,
      index: 3,
      name: "Обробка подій",
    }, {
      id: 4,
      course_id: 2,
      lection: "Активності та фрагменти\n\nРозробка додатків з декількома екранами\nОскільки розміри екрану у мобільних телефонів обмежені, досить часто доводиться розбивати застосунки на декілька незалежних екранів.\nСпочатку розглянемо як це початково було реалізовано в Андроїд й далі розглянемо, що можна покращити.\n\nСтворення нових активностей\nВ додатку можна створювати декілька активностей і організувати переходи між ними.\n\nТобто створити два окремих класи \nMainActivity та SecondActivity, з окремими layout файлами й організувати перехід між ними.\nПриклад коду\n\nIntent\nДля організації переходу між активностями існує спеціальний клас Intent, тобто якщо ми створили активність HelloActivity, то щоб перейти на неї необхідно скористатись наступним кодом:\nIntent intent = new Intent(this, HelloActivity.class);\nstartActivity(intent);\nЦим же класом можливо також передавати дані між активностями через екстра параметри:\nIntent intent = new Intent(this, HelloActivity.class);\nintent.putExtra(\"name\", \"Anatoliy\");\n\nЯвні та неявні (Implicit та Explicit) intents \nIntent\nImplicit\n intent\nExplicit \nintent\nПочати виклик\nВідправити пошту\nВідкрити мапи\nВідкрити веб-сторінку\nВідкрити активність\nЗапустити сервіс\nBroadcast\nIntentʼи можуть бути явними, коли явно вказується клас, який хочуть запустити: \nnew Intent(this, HelloActivity.class);\nАбо неявними, коли вказують дію і Андроїд буде намагатись знайти додаток, який цю дію виконає:\nIntent intent = new Intent();\nintent.setAction(Intent.ACTION_SEND);\nintent.putExtra(Intent.EXTRA_TEXT, \"Text\");\nintent.setType(\"text/plain\");\nДаний код, швидше за все покаже діалог вибору додатку який може обробити дію: відправити смс, створити нотатку і т.д.\n\nЗапуск сторонніх активностей через неявні Intent\nЗа допомогою неявних Intent можливий запуск будь-яких активностей, не тільки вашого додатку. Наступний код, наприклад, запустить камеру й поверне знімок у програму (щоб це спрацювало необхідно також оголосити що програма доступається до камери і запитати про це користувача):\nIntent takePictureIntent = new Intent(MediaStore.ACTION_IMAGE_CAPTURE);\nstartActivityForResult(takePictureIntent, REQUEST_IMAGE_CAPTURE);\n\nЄ дещо новіший метод, однак принцип той самий. Ваш додаток може таким чином відкривати камеру, налаштування, писати листи чи відправляти текст в чат, тощо.  А через екстра параметри передавати дані стороннім додаткам (налаштування камери, адресат та тіло листа і т.д.)\n\nРобота з правами доступу через активності\nДля прикладу роботи зі сторонніми активностями розглянемо як реалізовані запити на отримання прав доступу в додатках. \n\nОскільки додатки запускаються в обмеженій пісочниці вони не мають доступу ні до загальної файлової системи ні до пристроїв ні до персональних даних користувача.\n\nВ Android доступи поділяють на надані при інсталяції чи в рантаймі. Доступи надані при інсталяції є досить обмеженими й тому, найчастіше для більшості операцій доводиться запитувати доступи саме в рантаймі.\n\nРобота з правами доступу через активності\n<manifest ...>\n   \n   <uses-permission android:name=\"android.permission.CAMERA\"/>\n   \n   <application ...>\n       ...\n   </application>\n</manifest>\n\nОднак обидва типи доступів мають бути описані в AndroidManifest.xml. Це в основному необхідно для Play Store.\n\nНаприклад, щоб попередній запуск активності камери запрацював необхідно отримати до неї доступ. Спробуємо пройтись по етапах додавання доступу до камери:\n\nСпочатку його необхідно обʼявити:\n\nРобота з правами доступу через активності\nprivate ActivityResultLauncher<String> requestPermissionLauncher =\n   registerForActivityResult(new ActivityResultContracts.RequestPermission(), isGranted -> {\n       if (isGranted) {\n           // доступ отримано\n       } else {\n           // пояснення користувачу що функціональність буде недоступна\n       }\n   });\n\n\nЩоб запитати дозволу користувача на певну обмежену дію під час роботи програми зазвичай запускається стандартна Activity андроїда. Тому другим кроком є створення запиту на запуск активності та функцією, що отримує  результат за допомогою registerForActivityResult:\n\nРобота з правами доступу через активності\nif (ContextCompat.checkSelfPermission(this, Manifest.permission.CAMERA) == PackageManager.PERMISSION_GRANTED) {\n   // Додаток має доступ, можна виконувати дію\n   performAction(...);\n} else if (ActivityCompat.shouldShowRequestPermissionRationale(this, Manifest.permission.CAMERA)) {\n   // Показати пояснювальний діалог для навіщо необхідний доступ\n   showInContextUI(...);\n} else {\n   // Запуск активності на запит доступу\n   requestPermissionLauncher.launch(Manifest.permission.CAMERA);\n}\n\n\n\nОстаннє це власне код запиту доступу, спочатку перевіряється чи доступ вже є у додатку, якщо ні – запускається активність для запиту. Опціонально рекомендується показувати пояснювальний діалог навіщо власне цей доступ необхідний:\n\nПроблеми використання окремих активностей\nПідхід до побудови додатку з окремих активностей також має свої проблеми:\nКожна активність живе відокремлено від інших, тому є проблема передачі даних між активностями. Передача даних через Intent дещо обмежена і не зручна, тому якщо є дані, які є спільними для всього додатку, вони передаються через контекст додатку що теж не зручно, або ж через локальну БД. \nПроблеми з анімаціями переходів між активностями, особливо на старих версіях Андроїд.\nДані\nТому часто використовується варіант на підміни компонентів на базі однієї активності.\n\nFragments\nФрагменти це зазвичай набір компонентів з окремим layout та контролером (класом), які використовуються для організації частин інтерфейсів:\n\nFragments\nЧасто фрагменти використовують для організації кількох екранів додатку.\nПри такій організації проблема передачі стану значно спрощується, тому що фрагмент це просто один з елементів активності.\nПриклад коду\n\nПриклад активності з 2-ма фрагментами\n<FrameLayout\n   android:id=\"@+id/fragment_container\"\n   android:layout_width=\"match_parent\"\n   android:layout_height=\"669dp\"\n   app:layout_constraintBottom_toTopOf=\"@+id/bottomNavigationView\"\n   app:layout_constraintEnd_toEndOf=\"parent\"\n   app:layout_constraintHorizontal_bias=\"0.0\"\n   app:layout_constraintStart_toStartOf=\"parent\"\n   app:layout_constraintTop_toTopOf=\"parent\"\n   app:layout_constraintVertical_bias=\"1.0\">\n\n</FrameLayout>\n\n<com.google.android.material.bottomnavigation.BottomNavigationView\n   android:id=\"@+id/bottomNavigationView\"\n   android:layout_width=\"match_parent\"\n   android:layout_height=\"60dp\"\n   app:layout_constraintBottom_toBottomOf=\"parent\"\n   app:menu=\"@menu/nav_menu\"\n   tools:layout_editor_absoluteX=\"1dp\" />\nСтворимо новий проект і на головну активніть додамо 2 компоненти:\n\nКнопки меню\nКнопки внизу екрана задаються за допомогою нового ресурсу – меню. Його необхідно окремо створити (AndroidStudio пропонує його створити автоматично), додати 2 пункти та звʼязати з BottomNavigationView:\n\nСтворення фрагментів\nДля створення фрагментів можна скористатись меню New → Fragment → Fragment (Blank).\n\nДля кожного фрагменту створиться окремий файл розміщення компонентів.\n\nОрганізація навігації на фрагмент\nЩоб певний фрагмент відображався в контейнері його необхідно спочатку створити й встановити наступним чином:\nfinal FirstFragment firstFragment = new FirstFragment();\nfinal SecondFragment secondFragment = new SecondFragment();\n\n// Встановлення початкового екрану\ngetSupportFragmentManager().beginTransaction()\n       .replace(R.id.fragment_container, firstFragment)\n       .addToBackStack(null)\n       .commit();\nFragmentManager використовує транзакційний підхід, тобто після виконання набору дій необхідно викликати метод commit() й всі попередньо зареєстровані дії будуть виконані (або ж ні, при помилці в будь-якій з них).\n\nРучна організація навігації\nОстаннім пунктом є організація переходу між фрагментами при виборі відповідного пункту меню:\nbinding.bottomNavigationView.setOnItemSelectedListener((item) -> {\n   Fragment f = (item.getItemId() == R.id.menu_first) ? firstFragment : secondFragment;\n\n   getSupportFragmentManager().beginTransaction()\n           .replace(R.id.fragment_container, f)\n           .addToBackStack(null)\n           .commit();\n\n   return true;\n});\n\nСервіси\nЩе одним видом компонентів додатку на рівні з активностями є сервіси. \nВони дозволяють виконувати роботу в фоні, коли додаток не знаходиться на екрані.\nПрикладами сервісів можуть бути:\nПрогравач музики (Foreground service)\nСкачування / завантаження великого файлу (background service)\nФонова оптимізація файлів додатку\nФонова синхронізація додатку з сервером\nКоли ви хочете надавати певну функціональність іншим додаткам (bound service)\n\nПриклад коду сервісу\n<application>\n   ...\n   <service android:name=\".UploadService\">\n       <intent-filter>\n           ...       \n       </intent-filter>\n   </service>\n   …\n</application>\npublic class UploadService extends Service {\n\n   @Override\n   public void onStartCommand(Intent intent, int flags, int startId) {\n       // Завантаження великого файлу\n   }\n\n   @Override\n   public IBinder onBind(Intent intent) {\n       return null;\n   }\n}\nСервіс має наслідуватись від класу Service й мати запис в AndroidManifest.xml так само як і активності:\n\nЗапуск сервісу\nstartService(new Intent(this, UploadService.class));\nЗапуск сервісу аналогічний до запуску активності:\nДля Foreground сервісів, таких як медіа програвач, що показують нотифікацію про програвання музики є окремий метод:\nstartForegroundService(new Intent(this, UploadService.class));",
      generated: [Object ...],
      created_at: 2025-11-04T13:51:07.896Z,
      updated_at: 2025-11-04T20:27:38.805Z,
      index: 4,
      name: "Активності та фрагменти",
    }, {
      id: 5,
      course_id: 2,
      lection: "Навігація в складних додатках\nЗазвичай в реальних додатках досить багато екранів і тому навігація буває складною.\n\nОчікування користувачів стосовно навігації\nList Screen\nDetail Screen\nСтан навігації представляє собою стек екранів\n\nNavigation controller\nNavigation host\nfragment\nРозглянемо які підходи пропонує Андроїд для навігації. Одним з основних є використання навігаційного контролера, що дозволяє:\nАвтоматично організовувати транзакції над фрагментами та підтримує кнопку назад.\nВізуально задавати можливі переходи між екранами\nЗадавати анімацію переходів\nВикористовувати ViewModel обмежену (scoped) конкретним екраном та type safe передачу аргументів між ними\nDeep linking\n\nОсновні компоненти\nNavHost – контейнер в якому будуть підмінятись окремі екрани\nNavGraph – граф переходів між екранами\nNavController – координатор навігації, клас за допомогою якого можна з коду організувати перехід між екранами\nDestination – екран на який може відбутись перехід та необхідні дані для нього\nRoute –  \nNav\nhost\n\n\nОсновні кроки\nСтворимо navigation graph, який візуально показуватиме переходи між екранами\nСтворимо окремі фрагменти для кожного з екранів\nВізуально організуємо переходи між фрагментами, які називаються action та налаштуємо анімації для них\nЗа допомогою класу NavigationController можна буде викликати actions з коду для переходу між екранами\nДля прикладу зробимо додаток з 3-ма послідовними екранами, наприклад це може бути якась складна багатоетапна форма для введення. Для цього виконаємо наступні дії:\nКод прикладу\n\nСторення navigation graph\n1\n2\nСкористаємось менеджером ресурсів (1) необхідно вибрати тип ресурсу Navigation (2).\n\nДалі фрагменти можна створити прямо з навігації:\n\nФрагменти та переходи між ними\nДалі створимо декілька фрагментів та визначимо послідовність переходів між ними.\n\nДля кожного переходу можна також задати анімацію у властивостях.\n\nГоловне вікно\nВ основній активності програми необхідно додати NavHostFragment – це фрагмент, в якому будуть підмінятись всі створені екрани в залежності від дій користувача.\nПоставимо йому розміри match_parent, щоб він розтягувався на весь екран додатку, однак часто роблять кнопки навігації внизу екрану.\n\nПереходи\nОстаннім кроком є додати компоненти на кожен екран та власне організувати переходи в коді, наприклад при натисненні кнопки. Можна скористатись Navigation.findNavController(view) отримати доступ до контролера й у нього є метод navigate для власне переходів:\npublic class MainFragment extends Fragment {\n public View onCreateView(LayoutInflater inflater, ViewGroup container, Bundle state) {\n\n   View view = inflater.inflate(R.layout.fragment_main, container, false);\n\n   ((Button) view.findViewById(R.id.btn_main)).setOnClickListener(v -> {             \n Navigation.findNavController(view)\n    .navigate(R.id.action_mainFragment_to_detailsFragment);\n   });\n\n    return view;\n }\n}\n\nToolbar\nВ більшості додатків прийнято додавати Toolbar зверху й дублювати в ньому навігацію по додатку.\n\nТакий Toolbar автоматично підтримується навігаційним контролером і потребує мінімального налаштування.\nМожливо також додати меню в toolbar.\n\nНалаштування Toolbar в Activity\n// Налаштування Toolbar\n\nNavHostFragment navHostFragment = (NavHostFragment)getSupportFragmentManager().findFragmentById(R.id.fragmentContainerView);\nNavController navController = navHostFragment.getNavController();\n\nAppBarConfiguration appBarConfiguration =\n       new AppBarConfiguration.Builder(navController.getGraph()).build();\n\nToolbar toolbar = findViewById(R.id.toolbar);\n\nNavigationUI.setupWithNavController(toolbar, navController, appBarConfiguration);\n\n\nNavigation Drawer\nЧасто додатково додають бокову панель з розширеним меню, яка називається Navigation Drawer. Реалізується це шляхом зміни розміщення в активності, кореневим має бути DrawerLayout, який міститиме 2 фрагменти: основний та drawer:\n<androidx.drawerlayout.widget.DrawerLayout>\n\n    <!-- Основний екран -->\n    <androidx.fragment.app.FragmentContainerView\n        android:name=\"androidx.navigation.fragment.NavHostFragment\" />\n\n    <!-- Бокове меню -->\n    <com.google.android.material.navigation.NavigationView />\n\n</androidx.drawerlayout.widget.DrawerLayout>",
      generated: [Object ...],
      created_at: 2025-11-04T13:51:40.485Z,
      updated_at: 2025-11-04T20:28:05.767Z,
      index: 5,
      name: "Навігація",
    }, {
      id: 12,
      course_id: 2,
      lection: "Android Monitor ScrollView і HorizontalScrollView. Recycler View. Розробка динамічного списку. View Holder та адаптери. Обробка подій елементів списку.\n\n\nRecycler View\nДозволяє відображати списки елементів.\nІснує також ListView, однак його не рекомендується використовувати. RecyclerView є набагато ефективнішим, оскільки створює view компоненти тільки для елементів що безпосередньо відображаються на екрані й постійно їх перевикористовує.\n\nМодель Recycler View\n\nView Holders\nAdapter\nДані\nКожен view для елементу списку завертається в View Holder, який зазвичай містить посилання на конкретні елементи керування (текстові поля, зображення).\nСтворює ViewHolder’и та відображає дані в у ViewHolder’і (data ⇒ view.setText(...)).\nСамі дані, що необхідно відобразити. Список в памʼяті чи базі даних.\n\nПриклад Recycler View\nНаприклад створимо простий клас з даними та відобразимо його у списку:\npublic static record ListItem(String name, int size, boolean selected) {}\n\nprivate List<ListItem> items = new ArrayList<>(List.of(\n       new ListItem(\"First\", 10, false),\n       new ListItem(\"Second\", 10, false),\n       new ListItem(\"Third\", 10, true)\n));\nКод прикладу\n\nВигляд елементів списку\nЩоб відобразити список необхідно на активність додати RecyclerView. \n\n\n\nУ властивостях layoutManager використовуватимемо LinearLayoutManager й для елементів списку створимо окремий layout, якщо клікнути на атрибуті listitem, то студія запропонує створити його. \n\nДля списку виберемо просте розміщення з 2ма текстовими полями і checkbox:\n\nHolder\nclass ListHolder extends RecyclerView.ViewHolder {\n   final ItemLayoutBinding binding;\n\n   public ListHolder(ItemLayoutBinding binding) {\n       super(binding.getRoot());\n       this.binding = binding;\n   }\n}\nHolder це просто обгортка над елементом керування (в нашому випадку view, який містить 2 текстових поля та checkbox), яка також зберігає додаткові метадані, як то індекс елементу зі списку та інші.\n\nДля зручності можна зберегти binding та отримувати доступ до компонентів з нього:\n\nАдаптер для Recycler View\npublic class Adapter extends RecyclerView.Adapter<ListHolder> {\n\n  private List<ListItem> items;\n\n  public Adapter(List<ListItem> items) {\n    this.items = items;\n  }\n\n  // Має повертати загальну кількість елементів в списку\n  public int getItemCount() { return items.size(); }\n\n  // Має створювати новий ViewHolder контейнер\n  public ListHolder onCreateViewHolder(@NonNull ViewGroup parent, int viewType) {...}\n\n  // Має відобразити дані елементу з індексом index у ViewHolder\n  public void onBindViewHolder(@NonNull ListHolder holder, int index) {...}\n}\nОстання частина це адаптер – клас який забезпечує звʼязок даних ListItem та відображення. Він має наслідуватись від RecyclerView.Adapter та реалізовувати 3 методи:\n\nАдаптер для Recycler View - створення ViewHolder\npublic ListHolder onCreateViewHolder(@NonNull ViewGroup parent, int viewType) {\n   return new ListHolder(\n       ItemLayoutBinding.inflate(LayoutInflater.from(parent.getContext()), parent, false)\n   );\n}\n\nМетод створення ViewHolder досить простий, візьмемо привʼязку для layout для одного елементу списку й просто завернемо його в клас ListHolder:\nЦей метод буде викликатись для створення невеликої кількості ViewHolder’ів достатньої для відображення всіх елементів на екрані. Далі елементи будуть перевикористовуватись при прогортанні списку.\n\nАдаптер для Recycler View - ініціалізація ViewHolder\npublic void onBindViewHolder(@NonNull ListHolder holder, int position) {\n\n   var item = items.get(position);\n\n   holder.binding.title.setText(item.getName());\n   holder.binding.subtext.setText(String.valueOf(item.getSize()));\n   holder.binding.checkBox.setChecked(item.isSelected());\n\n   holder.binding.checkBox.setOnClickListener(v -> {\n       item.setSelected(holder.binding.checkBox.isChecked());\n   });\n}\n\nОстанній метод маючи holder та позицію в списку, необхідно заповнити всі текстові поля та checkbox даними з памʼяті:\n\nНалаштування адаптера\nprotected void onCreate(Bundle savedInstanceState) {\n   …\n  RecyclerView view = findViewById(R.id.recyclerView);\n\n  Adapter adapter = new Adapter(items);\n  view.setAdapter(adapter);\n\n\n   var fab = ((FloatingActionButton) findViewById(R.id.floatingActionButton));\n   fab.setOnClickListener(evt -> {\n       items.add(new ListItem(\"New item\", 5, false));\n       adapter.notifyItemInserted(items.size()-1);\n   });\n}\nНалаштування адаптера досить просте, необхідно створити його і задати для RecyclerView за допомогою методу setAdapter():\nСтворення кнопки для додавання елементів\n\nПриклад з навігацією та списком\nКод прикладу\nЩе один приклад комбінує список та навігацію:\nпри кліку на елементі списку вікривається окремий екран з деталями по цьому елементу.\nТакий підхід часто застосовується в багатьох додатках, booking, чати, доставка і так далі",
      generated: [Object ...],
      created_at: 2025-11-04T13:55:44.998Z,
      updated_at: 2025-11-04T20:28:27.739Z,
      index: 6,
      name: "Робота зі списками",
    }, {
      id: 6,
      course_id: 2,
      lection: "Локальні бази даних\nбібліотека\nФайл БД\nid\ntitle\ncontent\ncreated\n1\nFirst sa…\n…\n10:52 11.01\n2\nSecond…\n…\n16:24 1.02\n3\nThird…\n…\n19:01 3.02\nДосить часто додаткам необхідно зберігати чи кешувати великі обсяги структурованих даних локально. \nДля локального зберігання даних Андроїд додатки (власне як і iOS) можуть використовувати SQLite БД. \n\nSQLite це найпоширеніша БД,  яка поставляється у вигляді бібліотеки і присутня фактично на всіх ОС. \n\nRoom\nЦе бібліотека під Андроїд, яка фактично є дещо спрощеною версією ORM (Object Relation Mapper) для SQLite бази даних. Вона додає рівень абстракції над SQL і дозволяє просто конвертувати результати SQL виразів у обʼєкти і навпаки.\n\nЩоб почати її використовувати необхідно додати принайні 2 основні бібліотеки до проекту:\n\nimplementation(\"androidx.room:room-runtime:2.6.1\")\nannotationProcessor(\"androidx.room:room-compiler:2.6.1\")\n\nЦе сама бібліотека\nЦе генератор коду для роботи з БД на основі ваших даних\n\nAнотації\nRoom широко використовує анотації при описі обʼєктів. Анотації, це вид метаданих, які можна додавати до методів, полів чи обʼєктів. Вони доступні під час компіляції чи виконання коду й підказують компілятору чи бібліотекам, як саме має перевірятись чи виконуватись код.\n\nВ Java анотації позначаються з @, наприклад анотація @NotNull на методі підказує компілятору що метод не повинен повертати null, компілятор може при цьому видавати попередження, якщо це не так:\n\n@NotNull\npublic String setup() {\n   return null;\n}\n\nНотатки зі збереженням в БД\nКод прикладу\nДля прикладу роботи з БД зробимо простий додаток з нотатками, які зберігатимуться в локальній базі даних.\n\nДодаток підтримуватиме створення нових нотаток та редагування існуючих.\nБазовий код\n\nВизначення Entities\n@Entity(tableName = \"notes\")\npublic class Note {\n}\nДля початку необхідно визначитись з сутностями, які будуть в базі даних, фактично це обʼєкти для яких буде створено окремі таблички в БД.\n\nОскільки в прикладі будемо зберігати нотатки, створимо обʼєкт нотатки.\n\nКлас помічається анотацією @Entity, що вказує Room створити відповідно табличку в БД. \n\nОпціонально можна вказувати назву таблиці, індекси, зовнішні ключі.\n\n\nВизначення Entities\n@Entity(tableName = \"notes\")\npublic class Note {\n   @PrimaryKey(autoGenerate = true)\n   private long id;\n\n   @ColumnInfo(name = \"note_title\", index  = true)\n   private String title;\n   private String content;\n   private long created;\n\n   public Note() {}\n\n   @Ignore\n   public Note(String title, String content) {\n       this.title = title;\n       this.content = content;\n       this.created = System.currentTimeMillis();\n   }\n\n  // Getters / Setters\n}\nКожне поле класу буде описане відповідною колонкою в таблиці. \n\nRoom автоматично переводить з Java типів в SQL для багатьох базових типів, або ж можна написати власні функції перетворення (документація📕)\n\nДля таблиці обовʼязково додати поле primary key, з відповідною анотацією, в даному випадку ми також хочемо, щоб id генерувався базою.\n\nІнші поля помічаються опціональною анотацією @ColumnInfo. Якщо її опустити, то буде використовуватись назва поля.\n\nПоля чи методи помічені @Ignore будуть ігноруватись при генерації таблиць\n\nОпис відношень\n@Entity\npublic class User {\n   @PrimaryKey public long userId;\n   public String name;\n   public int age;\n}\nБібліотека підтримує роботу з усіма варіантами відношень між обʼєктами: 1 до 1, 1 до багатьох, багато до багатьох. Наприклад якщо є 2 обʼєкти (й відповідно 2 таблиці):\n@Entity\npublic class Playlist {\n   @PrimaryKey public long playlistId;\n   public long userCreatorId;\n   public String playlistName;\n}\n\nОпис відношень\npublic class UserWithPlaylists {\n   @Embedded public User user;\n   @Relation(\n     parentColumn = \"userId\",\n     entityColumn = \"userCreatorId\"\n   )\n   public List<Playlist> playlists;\n}\n@Query(\"SELECT * FROM User\")\npublic List<UserWithPlaylists> getUsersWithPlaylists();\nДля опису відношення користувач має багато плейлістів можна створити комбінований обʼєкт:\nТоді в DAO його можна дістати просто як:\n\nDAO (Data access objects)\nНаступним етапом є створення обʼєктів доступу DAO. Це обʼєкт, що містить набір зручних методів типу вичитати обʼєкт з БД за індексом, записати в БД, видалити, тощо. Фактично кожен SQL запит програми це зазвичай окремий метод DAO обʼєкта. \n\nПрийнято створювати по DAO обʼєкту для кожного Entity класу. \n\nЙ зручним є те, що достатньо описати інтерфейс DAO методів та додати анотації, а Room сам згенерує відповідні реалізації. Для початку створимо сам інтерфейс для роботи з нотатками та додамо анотацію @Dao:\n@Dao\npublic interface NotesDao {\n\n}\n\nDAO (Data access objects)\n@Dao\npublic interface NotesDao {\n\n   @Insert\n   long add(Note n);\n\n   @Update\n   void update(Note n);\n\n   @Delete\n   void delete(Note n);\n\n   @Query(\"SELECT * FROM note where id=:id\")\n   Note get(long id);\n\n   @Query(\"SELECT * FROM note ORDER BY created DESC\")\n   List<Note> all();\n}\nДля операцій запису достатньо додати відповідну анотацію й все інше зробить генератор коду Room. \n\nЯкщо метод insert повертає тим long - то, Room автоматично буде повертати id новоствореного запису. Для update/delete тип результату int, то вони повертатимуть кількість записів що було змінено/видалено. \n\nАргументами можуть бути як одна нотатка, так і масив чи список, тоді метод буде обробляти одразу кілька записів. \n\nДля читання з БД необхідно перед методом вказати анотацію @Query з відповідним SQL запитом. Параметри методу можна використовувати в запитах. \n\nRoom перевірить чи запити вірні на етапі компіляції\n\nDatabase\n@Database(entities = {Note.class}, version = 1)\npublic abstract class NotesDatabase extends RoomDatabase {\n   public abstract NotesDao getNotesDao();\n}\nNotesDatabase db = Room.databaseBuilder(getApplicationContext(), NotesDatabase.class, \"notes\").build();\nОстанній клас, який необхідно створити це самої бази даних. Все що він робить це поєднує всі Entities, DAO та інші глобальні налаштування в одному місці. Знову таки реалізація буде згенерована бібліотекою і необхідно тільки вказати загальний інтерфейс. \nОбовʼязковими є наслідування від RoomDatabase та анотація @Database. В анотації перелічуються всі сутності бази даних, та вказується версія (бібліотека підтримує міграції схеми БД):\nДалі щоб отримати доступ до БД в коді необхідно використати Builder (“notes” – це назва файлу БД):\n\nВикористання \nprotected void onCreate(Bundle savedInstanceState) {\n   super.onCreate(savedInstanceState);\n   setContentView(R.layout.activity_main);\n\n   NotesDatabase db = Room\n           .databaseBuilder(getApplicationContext(), NotesDatabase.class, \"notes\")\n           .build();\n  \n   List<Note> notes = db.getNotesDao().all();\n  \n   ...\n}\nМаючи БД можна отримати DAO і відповідно доступатись до бази даних:\n\nОбмеження на повільні виклики\nДеякі запити до бази даних можуть займати досить багато часу й, якщо їх виконувати в основному потоці, можуть блокувати інтерфейс додатку. \n\nЯкщо деякі фреймворки толерують таке використання, залишаючи використання на розсуд розробників. То в Андроїд підійшли більш кардинально й більшість повільних викликів (запити БД, мережеві запити) повністю заборонені й викликаються виключення. \n\nТаким чином розробники Андроїд страхуються від візуально повільно працюючих додатків, які псуватимуть враження від усієї системи.\n\nТому для виконання запиту його необхідно робити в окремому потоці. \n\nВиклики в окремому потоці\nprivate ExecutorService executor = Executors.newCachedThreadPool();\nexecutor.submit(() -> {\n  List<Note> notes = db.getNotesDao().all();\n});\nОдним з найпростіших варіантів виклику в окремому потоці, є через створення пула потоків. Зазвичай він створюється спільний на весь додаток:\nДалі використання є досить простим, в метод submit можна передати лямбда функцію, яка буде викликана в окремому потоці з пулу:\n⚠️ Це варіант простий, однак не найкращий. Рекомендованими опціями є використання бібліотек типу RxJava. Для Kotlin стандартним підходом є використання корутин. \n\nВиклики в окремому потоці\nprivate void loadNotesAsync() {\n   final Handler handler = new Handler(Looper.getMainLooper());\n\n   executor.submit(() -> {\n       notes.clear();\n       notes.addAll(db.getNotesDao().all());\n\n       handler.post(() -> adapter.notifyDataSetChanged());\n   });\n}\n\nВ більшості випадків результат з БД необхідно передати в інтерфейс. Андроїд компоненти не є потокобезпечиними і не дозволяють виклик з фонових потоків. Тому напряму присвоїти результат в список не вийде. Для виклику UI коду з фонового потоку існує спеціальний клас Handler:\nДаний виклик буде додано в чергу до виконання в основному потоці інтерфейсу.\n\nТранзакції\n@Dao\nabstract class NotesDao {\n   @Insert\n   abstract void insert(Note note);\n\n   @Delete\n   abstract void delete(Note note);\n\n   @Transaction\n   void replacePostInTransaction(Note oldNote, Note newNote) {\n       insert(newNote);\n       delete(oldNote);\n   }\n}\nRoom підтримує транзакційну роботу з даними:\nНаприклад, якщо потрібно замінити стару нотатку повністю новою, а не просто поміняти поля (зі зміною ідентифікатора), то при цьому потрібно щоб обидві операції або виконались, або жодна не виконалась (атомарність), інакше ми опинимось в ситуації коли:\n\nстара нотатка видалена, але нової немає – дані втрачено\nНова нотатка додана, а старий запис все ще існує\n\nТранзакції для читання\n@Dao\nabstract class NotesDao {\n   @Query(\"SELECT * FROM notes\")\n   abstract List<Note> getAll();\n\n   @Query(\"SELECT COUNT(*) FROM notes\")\n   abstract int getNotesCount();\n\n   @Transaction\n   boolean checkSize() {       \n       return getNotesCount() == getAll().size();\n   }\n}\nНаприклад, метод checkSize() може видавати false без транзакцій, оскільки можлива ситуація, коли між запитами інша транзакція оновила дані, й, наприклад, видалила нотатку. \nОднак транзакції потрібні не тільки при записі, а іноді й при читанні, наприклад:\nТранзакції дозволяють прочитати “знімок” бази в певний момент без врахування змін від паралельних транзакцій. Це називається ізоляція. \n\nДжерела даних\nНавіть якщо додаток повністю працює з віддаленими даними, найчастіше вони всеодно кешуються локально, оскільки це зручніше для користувача. \n\nConflict free replicated data types (CRDTs)\nОднак в додатках, які дозволяють спільну роботу на одними й тими ж даними це також створює проблеми синхронізації. \n\nНаприклад, якщо взяти розподілені нотатки, які можна редагувати оффлайн з 2х пристроїв, або ж спільно кілька користувачів можуть працювати над одними даними (навіть при обробці лайків така проблема може виникати).\nВ таких додатках можливі ситуації, коли старіші зміни можуть перетирати новіші, або ж зміни на сервері конфліктувати з локальними.\n\nНаприклад, нотатка редагувалась як локально так і на сервері й тоді не зрозуміло, які дані необхідно зберегти в результаті. \n\nТакі ситуації часто вирішуються за допомогою спеціальних структур даних, які взагалом називають безконфліктними реплікованими типами CRDTs.",
      generated: [Object ...],
      created_at: 2025-11-04T13:51:59.816Z,
      updated_at: 2025-11-04T20:29:04.519Z,
      index: 7,
      name: "Робота з базою даних",
    }, {
      id: 7,
      course_id: 2,
      lection: "Захист даних\nДосить часто додаток працює з даними на віддалених системах, які потребують автентифікації, або ж має роботу з персональними даними й тому має вищі вимоги до безпеки.\nРозглянемо сьогодні підходи до автентифікації користувачів для роботи як з локальними так і віддаленими даними.\n\nБазовий варіант авторизації\nЗазвичай першим ділом розглядають додавання логіну та пароля для додатку, які перевіряються на стороні серверу, або ж додатку, наприклад так:\nPOST https://server/authorize\n{\n   \"login\": \"userlogin\",\n   \"password\": \"user_password\"\n}\nСервер\nСесійний токен доступу\n\nНедоліки підходу з логіном/паролем\nОднак даний метод має достатньо недоліків:\nПри використанні телефону / email в якості логіну їх необхідно підтверджувати\nНеобхідна логіка відновлення пароля, яка зазвичай є найбільш вразливим місцем системи (часто також складним та непротестованим)\nКористувачу необхідно запамʼятовувати / записувати пароль\nВ звʼязку з попереднім пунктом найчастіше користувачі перевикористовують паролі, що накладає додаткову відповідальність на розробників при зберіганні паролів (точніше їх хешів), оскільки витік паролю може спричинити злам інших аккаунтів користувача.\nНеобхідність додаткового фактору \n\nBiometric Prompt\nОдним з методів захисту локальних даних в додатку є використання біометрії, тобто відбитків пальця, розпізнавання обличчя тощо. \nПри роботі з віддаленими даними такий метод також часто комбінується зі звичайною авторизацією, наприклад додаток банку авторизується на сервері перший раз, однак потребує біометрики для всіх послідуючих входів.\nДля додавання біометричного входу є бібліотека:\nimplementation(\"androidx.biometric:biometric:1.1.0\")\nКод прикладу\n\nBiometric prompt з криптографією\nМожливо також створити криптографічний ключ, який буде знаходитись з безпечному сховищі системи й операції з ним будуть доступні тільки після підтвердження біометричних даних. \nСекретний ключ\nAndroid keystore\n\nTrusted Execution Environment\nUser space\nБіометрія\nШифрування \nДешифрування \nТак додаток банку, наприклад може зберігати приватні дані зашифрованими локально й розшифровувати їх тільки після підтвердження.\n\nВхід через сторонні провайдери\nВхід через сторонні провайдери є простішою альтернативою для логіну та пароля. З недоліків це те, що такий підхід вимагає наявність аккаунта на одному з підтримуваних сервісів та що безпека вашого додатку напряму залежить від сторонньої системи.\nДозволяє організувати як створення аккаунта так і вхід в систему, як локально так і на сервері.\nПри цьому зазвичай використовується протокол Open ID Connect, розглянемо деяку його термінологію:\nID Provider – це провайдер, через який відбувається вхід (Google, Apple, Facebook)\nКлієнт – ваш додаток, який необхідно зареєструвати на сайті провайдера\nТокен – результат ідентифікації користувача, який містить дані користувача\n\nВхід через Google\nВаш сервер\nУвійти\nКористувач планує вхід для клієнта, ClientId\nСторінка входу\nЛогін + пароль гугл\nID Токен для клієнта\nID Токен \nЧи валідний ID Токен ?\nОблікові дані Google не проходять через додаток, а вводяться напряму на сайті Google, додаток отримує тільки ID токен, який лише можна валідувати на стороні Google.\nID Токен \n\nID token\nID token це зазвичай токен в форматі JSON Web token – це JSON дані підписані криптографічним ключем. В даних токена міститься інформація про користувача: email, імʼя, тощо та цифровий підпис. Публічні ключі для перевірки підпису можна отримати тут.\n\nЗазвичай такий токен дійсний дуже короткий час (3 хв для google).\n\nРеалізація входу через Google\ndependencies {\n\n   implementation(\"androidx.credentials:credentials:1.3.0\")\n   implementation(\"androidx.credentials:credentials-play-services-auth:1.3.0\")\n   implementation(\"com.google.android.libraries.identity.googleid:googleid:1.1.1\")\n   …\n}\nДля Андроїд існує набір бібліотек Jetpack від Google, в яких вхід вже реалізований й досить простий: \nнеобхідно налаштувати підтримувані типи входу \nВикликати діалог автентифікації\nОбробити результат автентифікації\n\nДля початку додамо необхідні бібліотеки\n\nНалаштування проекту в консолі гугл\nДля реєстрації клієнта авторизації (вашого додатку) необхідно для початку зареєструвати його в гугл консолі: https://console.cloud.google.com/ . Створивши новий проект та в API & Services -> Credentials створивши клієнта:\n\nСтворення клієнта\nДля авторизації локально достатньо одного клієнта типу Android. Package name можна взяти той, який вказували при створенні проекту, а щоб отримати SHA1 сертифікату необхідно скористатись командою:\n./gradlew signingreport\nЯкщо ж існує також серверна частина додатку, то для неї необхідно додати окремого клієнта типу веб додаток і скопіювати client ID. \n\nНалаштування та відображення діалогу аутентифікації\nCredentialManager manager = CredentialManager.create(this);\n\nCredentialOption googleIdOption = new GetGoogleIdOption.Builder()\n       .setFilterByAuthorizedAccounts(false)\n       .setServerClientId(\"Client ID з консолі гугл\")\n       .setAutoSelectEnabled(true)\n       .build();\n\nGetCredentialRequest request = new GetCredentialRequest.Builder()\n       .addCredentialOption(googleIdOption)\n       .setPreferImmediatelyAvailableCredentials(false)\n       .build();\n\nmanager.getCredentialAsync(this, request, new CancellationSignal(), ContextCompat.getMainExecutor(this), callback);\n\n\nСтворення авторизатора через гугл\nНалаштування діалогу авторизації\nЗапуск діалогу авторизації, callback – це обробник результатів авторизації\n\nОбробник результатів авторизації\nCredentialManagerCallback<GetCredentialResponse, GetCredentialException> callback = new CredentialManagerCallback<>() {\n   \n   public void onResult(GetCredentialResponse resp) {\n\n       if (resp.getCredential().getType() == GoogleIdTokenCredential.TYPE_GOOGLE_ID_TOKEN_CREDENTIAL) {\n           GoogleIdTokenCredential cred = GoogleIdTokenCredential.createFrom(resp.getCredential().getData());\n\n           Log.i(TAG, \"Google ID token: \" +  cred.getIdToken());\n       }\n\n       Toast.makeText(MainActivity.this, \"Authenticated\", Toast.LENGTH_SHORT).show();\n   }\n\n   public void onError(@NonNull GetCredentialException e) {\n       Log.w(TAG, \"Failed to authenticate: \" + e.getMessage());\n       Toast.makeText(MainActivity.this, \"Failed to authenticate\", Toast.LENGTH_SHORT).show();\n   }\n};\n\nPasskeys / WebAuthn\nЦе досить новий та перспективний підхід до автентифікації розроблений консорціумом Fido Alliance (Google, Apple, Microsoft, IBM, Amazon). \n\nОсновна ідея його в тому, що на пристрої генерується пара приватний/публічний ключ. Останній передається на сервер та асоціюється з акаунтом. Приватний ключ зберігається в менеджері паролів пристрою та захищений біометрикою.\n\nПри аутентифікації сервер пропонує підписати випадковий набір байт приватним ключем і перевіряє підпис.\n\nFirebase автентифікація\nПоки що автентифікація була тільки на клієнтській стороні, спробуємо також додати серверну автентифікацію.\nДля цього скористаємось сервісом Firebase. Це сервіс, який реалізує деякі загальновживані функції для мобільних додатків, такі як:\nКерування користувачами\nВіддалена база та сховища даних \nВідправка push повідомлень\nАналітика та моніторинг\nМашинне навчання та AI\n\nВхід через Google з Firebase\nВаш сервер\nFirebase\nУвійти\nКористувач планує вхід для клієнта\nСторінка входу\nЛогін + пароль гугл\nID Токен для клієнта\nID Токен \nЧи валідний ID Токен ?\nФактично весь процес нічим не відрізняється, а Firebase виступає у якості сервера\n\nНалаштування автентифікаторів Firebase\nСтворимо новий додаток та Firebase проект в консолі https://console.firebase.google.com/ та додамо підтримку гугл аутентифікації:\n\nДодамо Андроїд додаток\nВ консолі Firebase зареєструємо додаток. В результаті буде утворено файл google-services.json, який необхідно скопіювати в папку app/ проекту.\n\nВикористання Firebase в проекті\nimplementation(platform(\"com.google.firebase:firebase-bom:33.7.0\"))\nimplementation(\"com.google.firebase:firebase-analytics\")\nimplementation(\"com.google.firebase:firebase-auth\")\nimplementation(\"com.firebaseui:firebase-ui-auth:8.0.2\")\nimplementation(\"com.google.android.gms:play-services-auth:20.3.0\")\nДодамо бібліотеки firebase в залежності проекту, бібліотеки Google для гугл автентифікації:\nimplementation(\"com.github.bumptech.glide:glide:4.16.0\")\nА також бібліотеку Glide, яку будемо використовувати щоб завантажити аватар користувача:\n\nКомпоненти додатку\nОсновні компоненти додатку, які будуть необхідні це:\n\nTextView для відображення імені користувача\n\nImageView для відображення зображення користувача (з гугл аккаунту)\n\nРобота з користувачами в Firebase\nFirebaseAuth auth = FirebaseAuth.getInstance();\nЩоб почати роботу з автентифікацією в додатку необхідно отримати об’єкт FirebaseAuth:\nFirebaseUser user = auth.getCurrentUser();\nЗ нього можна отримати користувача, якщо він вже здійснював вхід, або ж null:\npublic void onCreate() {\n   … \n   FirebaseAuth auth = FirebaseAuth.getInstance();\n   FirebaseUser user = auth.getCurrentUser();\n\n   if (user == null) {\n\tshowLoginScreen();\n   } else {\n       showUserInfo();\n   }\n}\nТому в функції створення активності можна додати наступну логіку:\n\nЯкщо користувача немає – відобразити активність для входу в додаток\n\nЯкщо користувач вже є – відобразити його дані\n\nКод вікна логіна\nIntent signInIntent = AuthUI.getInstance().createSignInIntentBuilder().setAvailableProviders(providers).build();\n\nActivityResultLauncher<Intent> signInLauncher = registerForActivityResult(new FirebaseAuthUIActivityResultContract(),\n       result -> {\n               IdpResponse response = result.getIdpResponse();\n               if (result.getResultCode() == RESULT_OK) {\n                   showUserInfo();\n               } else {\n                 // логін невдалий  \n               }\n       }\n);\n\nsignInLauncher.launch(signInIntent);\nList<AuthUI.IdpConfig> providers = Arrays.asList(\n       new AuthUI.IdpConfig.EmailBuilder().build(),\n       new AuthUI.IdpConfig.GoogleBuilder().build());\nВизначимо список підтримуваних провайдерів логіну (логін/пароль та Google):\nЙ власне запуск активності логіну, також визначається \n\nВідображення даних користувача\nЙ останнє це відображення даних користувача:\nFirebaseUser user = FirebaseAuth.getInstance().getCurrentUser();\n\nTextView tv = findViewById(R.id.tvUser);\ntv.setText(\"Hello \" + user.getDisplayName());\n\nif (user.getPhotoUrl() != null) {\n   ImageView iv = findViewById(R.id.imageView);\n   Glide.with(this).load(user.getPhotoUrl()).into(iv);\n}",
      generated: [Object ...],
      created_at: 2025-11-04T13:52:27.117Z,
      updated_at: 2025-11-04T20:29:49.927Z,
      index: 8,
      name: "Авторизація",
    }, {
      id: 8,
      course_id: 2,
      lection: "Робота з Firestore\nМинулого разу ми почали працювати з Firebase автентифікацією, однак Firebase містить багато різноманітних сервісів, які полегшують життя розробникам:\nАналітика\nХостинг бекенд додатків\nВіддалена конфігурація додатків\nФайлове сховище\nБаза даних (Realtime DB / Firestore)\nВідправка push повідомлень FCM\nВідправка push повідомлень по факту можлива тільки з FCM.\n\nДемо додаток\nДля демо розробимо додаток де можна буде колаборативно публікувати фото та підписи для них різними користувачами. \nВсі публікації зберігатимуться на сервері в Firestore DB й оновлюватимуться автоматично.\nПри публікації нового запису, всім користувачам відправлятиметься оновлення про допис.\nКод прикладу\nБазовий код\n\nFirestore DB\nFirestore це БД, що дозволяє зберігати дані організовані як колекції документів. Колекція має назву, наприклад users.\nКожен документ має унікальний ідентифікатор та може містити будь-який набір полів різних типів. \n\nВкладена структура документів\nПри цьому документ може містити посилання на підколекції, таким чином організовуючи всі дані в деревовидну структуру. Яку також представляють у вигляді шляху до документу:\n\nПриклад структури документів\nНаприклад, додаток для запису про тренування може мати наступну структуру.\nКолекцію користувачів, де кожен документ містить поля, що описують користувача.\nВ записі користувача може бути посилання на підколекцію з його тренуваннями (типами тренувань).\nЙ кожен тип тренування може посилатись на колекцію з історичними записами, коли і як відбулося тренування.\n\nСтворення колекції\nДля початку роботи скористаємось раніше створеним Firebase проектом, до якого додамо Firestore й створимо колекцію stories:\n\nНалаштування прав\nДля можливості запису та читання з БД необхідно буде налаштувати права доступу до колекцій, які знаходяться у вкладці Rules:\nДані правила дозволяють детально налаштувати правила доступу в залежності від того чи зареєстрований користувач чи ні, його ідентифікатора чи полів самих даних.\n\nНаприклад, можна дати доступ до записів колекції, тільки якщо в записі є поле public = true, або ownerId, яке співпадає з ідентифікатором поточного користувача. \n\n\nДетальніший опис правил можна знайти в документації.\n\nНалаштування прав\nДля нашого тесту задамо простий набір правил, що дозволить доступ до всіх колекцій БД для всіх авторизованих користувачів:\nrules_version = '2';\n\nservice cloud.firestore {\n match /databases/{database}/documents {\n   match /{document=**} {\n     allow read, write: if request.auth != null;\n   }\n }\n}\nПеревірити набір правил можливо за допомогою Playground:\nТакий набір правил не варто використовувати в реальних системах! Однак він є цілком достатнім для PoC чи Demo. \n\nСтруктура документів\nКожен запис буде досить мінімалістичним: зображення, автор та підпис, тому для його опису документ може виглядати наступним чином:\nДля простоти зберігатимемо тільки посилання на зображення.\n\nКод додавання нового запису\nFirebaseFirestore db = FirebaseFirestore.getInstance();\nCollectionReference collection = db.collection(\"stories\");\n\nMap<String, String> obj = Map.of(\n  \"author\", \"Sergii\",\n  \"title\", \"Perfect vacation place\",\n  \"imageUrl\", \"https://img.site.com/file01.png\"\n);\n\ncollection.add(obj);\nЩоб додати запис в колекцію, необхідно отримати посилання на колекцію та просто додати дані у вигляді словника з полями:\nПри цьому ідентифікатор документа буде сформовано автоматично. Існує також функція set для оновлення або додавання документу з заданим ID.\n\nАсинхронне додавання\ncollection.add(obj).addOnCompleteListener(r -> {\n   Log.i(TAG, \"Added a story\");\n}).addOnFailureListener(err -> {\n   Log.w(TAG, \"Failed to add story\", err);\n});\n\nОднак оскільки дані відправляються на сервер вся робота з БД ведеться асинхронно, тому щоб знати результат додавання необхідно зареєструвати функції, які викликатимуться після додавання:\n\nКлас для опису документу\npublic class Story {\n   private String title;\n   private String author;\n   private String imageUrl;\n\n   public Story() {\n       this(null, null, null);\n   }\n\n   ...\n   // get / set методи\n}\nВикористовувати словники полів не дуже зручно, тому Firestore клієнт підтримує автоматичне перетворення в/з звичайні класи. Вони мають мати конструктор за замовчуванням та get / set методи:\npublic void addStory(Story s) {\n   collection.add(s);\n}\n\nОтримання списку документів\ncollection.get().addOnSuccessListener(snapshot -> {\n   List<DocumentSnapshot> list = snapshot.getDocuments();\n   ...\n\n}).addOnFailureListener(err -> {\n   Log.w(TAG, \"Failed to get list\", err);\n});\nДля отримання списку всіх документів можна скористатись методом get(), який поверне знімок в певний момент часу всіх документів колекції. При цьому оскільки це мережевий виклик він повертається не одразу, а у вигляді callback функцій, так само і з помилками\nОтримання всього списку документів підійде тільки для невеликих колекцій, в більшості випадків потрібно проводити фільтрацію документів, наприклад \n\ncollection.whereGreaterThan(\"stamp\",  \n   ZonedDateTime.now().minusMonths(1).toInstant().getEpochSecond()).get()\n\n\nОтримання оновлень колекції\n\nОднак в нашому випадку ми хочемо відслідковувати всі оновлення колекції автоматично, для цього є метод: \ncollection.addSnapshotListener((snapshot, err) -> {\n   if (err != null) {\n       Log.w(TAG, \"Failed to get list\", err);\n       return ;\n   }\n\n  // Перетворення списку документів в список обʼєктів Story\n  List<Story> list = snapshot.getDocuments().stream().map(d -> d.toObject(Story.class)).toList();\n});\n\nТепер цей метод буде викликатись кожен раз як будь-хто додасть новий документ в колекцію й оновлювати с\n\nFirebase Cloud Messaging\nСервіс дозволяє відправляти повідомлення користувачам, навіть якщо додаток закритий.\nВін працює для iOS, Android та браузерів.\nМає вбудовані функції для таргетованої розсилки повідомлень.\nДля початку роботи з ними необхідно зареєструвати додаток в Firebase та додати google-services.json в проект.\n\nТипи повідомлень\nВ основному є 2 типи повідомлень:\n– нотифікації, які бібліотека Firebase буде обробляти сама й опціонально додаток\n– повідомлення з даними, які має обробити тільки ваш додаток\n\nТакож є 3 варіанти відправки повідомлень:\n– масова розсилка групам пристроїв за критерієм (наприклад рекламні повідомлення)\n– розсилка по темам (topics) на які підписані клієнтські додатки\n– індивідуальна розсилка на конкретний пристрій\n\nОсновна схема роботи для індивідуальних повідомлень\n1. Отримання токена\n2. Відправка токена \nна сервер\n3. Нотифікація + токен\n4. Push подія\n5. Відображення нотифікації\nДля того, щоб серверна частина могла відправляти повідомлення конкретному користувачу необхідно виконати наступні дії:\nВ додатку буде викликано метод onNewToken, з унікальним токеном пристрою (він періодично змінюється).\nДодаток має відправити його на сервер та звʼязати з користувачем\nПри необхідності відправити нотифікацію необхідно буде вказати токен пристрою.\n\nНалаштування в проекті\n// messaging\nimplementation(\"com.google.firebase:firebase-messaging\")\nДля початку необхідно додати бібліотеку firebase-messaging:\n\nДодати сервіс обробки повідомлень\npublic class NotificationsService extends FirebaseMessagingService {\n\n   public static final String TAG = \"NotificationsService\";\n\n   @Override\n   public void onNewToken(@NonNull String token) {\n       Log.i(TAG, \"New firebase token: \" + token);\n       // зберегти токен на сервері асоційованим з користувачем\n   }\n\n   @Override\n   public void onMessageReceived(@NonNull RemoteMessage message) {\n       Log.i(TAG, \"Message received: \" + message.getData());\n   }\n}\n\nНеобхідно створити клас, що наслідується від \n\nОтримання токену\nТокен також можна запросисти з сервера в будь який момент:\nFirebaseMessaging.getInstance().getToken()\n .addOnCompleteListener(new OnCompleteListener<String>() {\n   public void onComplete(Task<String> task) {\n       if (!task.isSuccessful()) {\n           Log.w(TAG, \"Fetching FCM registration token failed\", task.getException());\n           return;\n       }\n\n       String token = task.getResult();\n   }\n});\n\nНалаштувати сервіс в AndroidManifest\n<!-- Сервіс обробки повідомлень -->\n<service\n   android:name=\".notifications.NotificationsService\"\n   android:exported=\"false\">\n   <intent-filter>\n       <action android:name=\"com.google.firebase.MESSAGING_EVENT\" />\n   </intent-filter>\n</service>\n\n<!-- Колір та іконка для нотифікацій за замовчуванням -->\n<meta-data\n   android:name=\"com.google.firebase.messaging.default_notification_icon\"\n   android:resource=\"@drawable/ic_notifications\" />\n<meta-data\n   android:name=\"com.google.firebase.messaging.default_notification_color\"\n   android:resource=\"@color/colorAccent\" />\n<meta-data\n   android:name=\"com.google.firebase.messaging.default_notification_channel_id\"\n   android:value=\"stories_channel\" />\n\nСервіс обробки повідомлень необхідно також додати в AndroidManifest. Опціонально можна також вказати іконку та колір нотифікацій за замовчуванням:",
      generated: [Object ...],
      created_at: 2025-11-04T13:52:42.381Z,
      updated_at: 2025-11-04T20:30:36.883Z,
      index: 9,
      name: "Робота з Firebase",
    }, {
      id: 9,
      course_id: 2,
      lection: "Опис задачі\nВ даній лекції розглянемо організацію роботи з HTTP сервісами, на прикладі додатку, що відображатиме зарядні пристрої для електромобілів на мапі. \nДодатково по ходу роботи попрацюємо з Google мапами, мітками на мапах та взаємодією з ними.\nКод прикладу\n\nОсновні обʼєкти на мапах\nМаркери (markers)\nФігури (shapes/polylines) \nМаршрути (Routes) \n\nСервіс зарядних пристроїв\nДля отримання списку зарядних пристроїв для певної зони можна скористатись сервісом https://openchargemap.org. Після реєстрації там можна отримати ключ і безкоштовно користуватись їх API.\n\n\nAPI cервісу зарядних пристроїв\nВ API нас цікавить єдиний запит POI (points of interest): https://api.openchargemap.io/v3/poi/?output=json&latitude=XXX&longitude=XXX&distance=10\nКоординати Вінниці:\nlat:  49.23278000\nlong:  28.48097000\nСервіс повертає JSON наступного виду:\n\nВерхній рівень це список обʼєктів:\n[ {…}, {...}, {...} ] \n\nКожен обʼєкт має багато різних полів що описують зарядний пристрій, з яких нас цікавить підобʼєкт AddressInfo з координатами зарядки\n\nМоделі для додатку\nОпишемо моделі для майбутнього додатку, які відповідатимуть структурі JSON з сервісу:\npublic class ChargePoint {\n\n   private AddressInfo addressInfo;\n\n   public ChargePoint() {\n   }\n   // додаткові конструктори\n   // get / set методи\n}\npublic class AddressInfo {\n   private String title;\n   private double latitude;\n   private double longitude;\n\n   public AddressInfo() {\n   }\n   // додаткові конструктори\n   // get / set методи\n}\n\n* В Java також існує значно зручніший HttpClient, однак Android використовує дещо застарілі версії Java, тому він недоступний\nHTTP запити без сторонніх бібліотек\nURL url = new URL(\"https://api.openchargemap.io/...\");\nInputStream stream = url.openConnection().getInputStream();\nТепер задача отримати дані з сервісу та перетворити їх у список ChargePoint.\nДля початку скористаємось стандартними засобами Android/Java. Отримати JSON можна за допомогою класу URL:\nString s = new BufferedReader(\nnew InputStreamReader(url.openConnection().getInputStream()))\n      \t .lines().collect(Collectors.joining(\"\\n\")\n);\nПрочитати JSON в стрічку буде виглядати дещо складніше (необхідно завернути потік в Reader щоб перетворити потік байт в текст та додати буферизацію):\n\nРозбір JSON\nВ Андроїд є вбудована бібліотека для роботи з JSON й код розбору відповіді за допомогою неї виглядатиме наступним чином:\nJSONArray array = new JSONArray(s);\nArrayList<ChargePoint> points = new ArrayList<ChargePoint>();\n\nfor (int i = 0; i < array.length(); i++) {\n   JSONObject p = array.getJSONObject(i).getJSONObject(\"AddressInfo\");\n   points.add(new ChargePoint(\n       new AddressInfo(\n               p.getString(\"Title\"),\n               p.getDouble(\"Latitude\"),\n               p.getDouble(\"Longitude\")\n       )\n   ));\n}\n\nRetrofit клієнт\nПрацювати з JSON та HTTP вручну не зручно, тому можна скористатись сторонніми бібліотеками, популярною з яких є retrofit client.\nВін дозволяє декларативно описати клієнт сервісу та сам перетворить JSON в обʼєкти (за допомогою бібліотеки GSON).\nДля початку його необхідно додати в build.gradle.kts модуля:\nimplementation(\"com.squareup.retrofit2:retrofit:2.11.0\")\nimplementation(\"com.squareup.retrofit2:converter-gson:2.11.0\")\n\n\nОпис клієнту\npublic interface OpenchargeMapClient {\n\n   @GET(\"?output=json\")\n   Call<List<ChargePoint>> list(\n           @Query(\"latitude\") double latitude,\n           @Query(\"longitude\") double longitude,\n           @Query(\"distance\") int distance);\n\n }\nТепер опишемо інтерфейс клієнту, без реалізації методів. Клієнт матиме лише 1 метод, який для заданих координат та радіусу буде повертати список точок:\nЗа допомогою анотацій вказуються що параметри функції відповідають параметрам GET запиту.\n\nРеалізація клієнту\nОписувати реалізацію інтерфейсу клієнту не потрібно, його бібліотека згенерує сама, необхідно тільки вказати яким чином це зробити:\npublic static OpenchargeMapClient build(String key) {\n   OkHttpClient.Builder httpClient = new OkHttpClient.Builder();\n\n   httpClient.addInterceptor(chain -> {\n       Request request = chain.request().newBuilder().addHeader(\"X-API-Key\", key).build();\n       return chain.proceed(request);\n   });\n\n   Retrofit retrofit = new Retrofit.Builder()\n           .baseUrl(\"https://api.openchargemap.io/v3/poi/\")\n           .client(httpClient.build())\n           .addConverterFactory(GsonConverterFactory.create())\n           .build();\n\n   return retrofit.create(OpenchargeMapClient.class);\n}\n\n\nФінальний метод отримання точок\nprivate List<ChargePoint> getPointsRetrofit(LatLng point) {\n   try {\n       OpenchargeMapClient client = OpenchargeMapClient.build(getString(R.string.opencharge_key));\n       return client.list(point.latitude, point.longitude, 5).execute().body();\n   } catch (Exception e) {\n       Log.e(TAG, \"Error\", e);\n       return Collections.emptyList();\n   }\n}\n\nОтже фінальний метод, щоб отримати точки з сервісу виглядатиме наступним чином:\n\nПомилки розбору\nПри використанні клієнту будуть виникати помилки розбору JSON. Причиною є те, що в моделях поля визначені з маленької літери, тоді як в JSON всі поля починаються з великої, це можна виправити зазначивши відповідність імен за допомогою спеціальної анотації:\npublic class AddressInfo {\n   @SerializedName(\"Title\")\n   private String title;\n\n   @SerializedName(\"Latitude\")\n   private double latitude;\n\n   @SerializedName(\"Longitude\")\n   private double longitude;\n}\npublic class ChargePoint {\n   @SerializedName(\"AddressInfo\")\n   private AddressInfo addressInfo;\n}\n\nРобота з Google Maps\nНайпростішим варіантом початку роботи з Google Maps буде додати фрагмент чи активність з мапами.\nЦя дія автоматично додасть необхідні бібліотеки та плагіни та згенерує відповідні відображення.\n\n\nGoogle пропонує роботу з мапами як потенційно платний сервіс, тому для роботи з мапами необхідно створити проект та отримати API ключ та додати платіжну картку. \nОднак для більшості задач безкоштовного API буде більш ніж достатньо.\nБажано також явно обмежити ключ тільки для роботи з конкретним додатком, вказавши package name з проекту та відбиток сертифікату (можна отримати командою ./gradlew signingreport).\nОтриманий ключ необхідно вставити в AndroidManifest.xml.\nОтримання ключа API\n\nРобота з MapFragment\nЗавантаження мапи відбувається асинхронно, тому всі дії з нею необхідно виконувати в згенерованому методі onMapReady().\nНаприклад ми можемо додати обробники на основні дії з мапою:\n\nmap.setOnCameraMoveListener(() -> Log.i(TAG, \"Camera moved\"));\n\n\nmap.setOnMapClickListener(() -> Log.i(TAG, \"Map clicked\"));\n\nЯкщо необхідно дозволити показувати поточне положення користувача, це необхідно явно вказати:\nmap.setMyLocationEnabled(true);\n\n\nДозволи для визначення положення користувача\nВизначення положення користувача вимагає відповідних дозволів, які необхідно спочатку задекларувати в AndroidManifest.xml:\n<manifest xmlns:android=\"http://schemas.android.com/apk/res/android\"\n   xmlns:tools=\"http://schemas.android.com/tools\">\n\n   <uses-permission android:name=\"android.permission.ACCESS_COARSE_LOCATION\" />\n   <uses-permission android:name=\"android.permission.ACCESS_FINE_LOCATION\" />\n   <uses-permission android:name=\"android.permission.ACCESS_BACKGROUND_LOCATION\" />\n\n...\n\nДозволи для визначення положення користувача\nІ потім запитати в користувача, наприклад наступним чином:\nif (\n ActivityCompat.checkSelfPermission(this, Manifest.permission.ACCESS_FINE_LOCATION) != PackageManager.PERMISSION_GRANTED\n){\n   ActivityCompat.requestPermissions(this, new String[] {android.Manifest.permission.ACCESS_FINE_LOCATION }, 1);\n}\n\n\nОскільки користувач може заборонити доступ до місцезнаходження, а додаток має при цьому працювати, то логічним є також дозволяти визначати місцезнаходження тільки якщо доступ був наданий:\n\nmap.setMyLocationEnabled(\n   ActivityCompat.checkSelfPermission(this, android.Manifest.permission.ACCESS_FINE_LOCATION) == PackageManager.PERMISSION_GRANTED\n);\n\nЗавантаження даних про зарядні пристрої\nЗберемо тепер весь додаток в єдине ціле. Щоб відображати зарядні пристрої на мапі додамо обробник натиснення на мапу:\nmap.setOnMapClickListener(clickPoint -> {\n   List<ChargePoint> chargers = getPoints(clickPoint);\n\n   for (ChargePoint c: chargers) {\n       Marker m = map.addMarker(new MarkerOptions()\n   .position(new LatLng(c.getAddressInfo().getLatitude(), c.getAddressInfo().getLongitude()))\n               .title(c.getAddressInfo().getTitle())\n               .icon(BitmapDescriptorFactory.fromResource(R.drawable.charger))\n       );\n   }\n});\nКод отримує список зарядних пристроїв для точки на мапі й для кожного створює маркер з відповідною координатою та підписом.\n\nРобота з HTTP в основному потоці\nОднак, якщо ми спробуємо виконати запит з Activity то одразу отримаємо помилку виконання: \nБібліотеки Android явно обмежують використання мережевих викликів в основному потоці (який відмальовує додаток), оскільки це призводить до негативного користувацього досвіду щодо додатку та платформи взагалом.\n\nТому виконання мережевих викликів має відбуватись в окремому потоці \nчи сервісі.\n\nРобота з потоками\nВ Java робота з потоками досить проста, для початку потрібно створити сервіс з пулом потоків:\nExecutorService executor = Executors.newSingleThreadExecutor();\nexecutor.submit(() -> {\n   // Код в фоновому потоці\n});\nданий варіант матиме тільки один потік в пулі, однак можна створювати й пули з багатьох потоків, наприклад:\nExecutorService executor = Executors.newFixedThreadPool(3);\nЙ далі можна додавати задачі, які будуть виконуватись в фоновому потоці:\nВиклик submit() завершиться миттєво й передана функція буде пізніше виконана на першому вільному потоці з пула. \n\nОновлена версія з потоками\nmap.setOnMapClickListener(clickPoint -> {\n   Log.i(TAG, \"Map clicked\");\n\n   executor.submit(() -> {\n       List<ChargePoint> chargers = getPoints(clickPoint);\n\n       for (ChargePoint c : chargers) {\n           Marker m = map.addMarker(...);\n       }\n   });\n});\nОтже необхідно оновити код завантаження точок:\nВ даній частині всеодно виникатиме помилка: \nтепер ми доступаємось до елементів інтерфейсу зі сторонніх потоків\n\nПовернення в основний потік\nmap.setOnMapClickListener(clickPoint -> {\n\nexecutor.submit(() -> {\n   List<ChargePoint> chargers = getPoints(clickPoint);\n\n   MapsActivity.this.runOnUiThread(() -> {\n       for (ChargePoint c: chargers) {\n           Marker m = map.addMarker(...);\n       }\n   });\n});\n\n});\nОтже фінальний код виглядатиме наступним чином:\n\nПовернення в основний потік\nmap.setOnMapClickListener(clickPoint -> {\n\nexecutor.submit(() -> {\n   List<ChargePoint> chargers = getPoints(clickPoint);\n\n   MapsActivity.this.runOnUiThread(() -> {\n       for (ChargePoint c: chargers) {\n           Marker m = map.addMarker(...);\n       }\n   });\n});\n\n});\nОтже фінальний код виглядатиме наступним чином:\nФоновий потік\nОсновний потік\nОсновний потік",
      generated: [Object ...],
      created_at: 2025-11-04T13:52:57.229Z,
      updated_at: 2025-11-04T20:31:26.515Z,
      index: 10,
      name: "Робота з Http запитами",
    }, {
      id: 10,
      course_id: 2,
      lection: "Мультиплатформенна розробка\nВ другій частині курсу розглянемо один з підходів до мультиплатформенної розробки мобільних додатків використовуючи Javascript / Typescript та фремворк React Native.\nФрейморк базується на бібліотеці React.js для Web розробки, однак використовує нативні компоненти та компіляцію в нативний код платформи\nПідтримує всі основні платформи: iOS, Android, Web (однак iOS все ще потребує mac).\n\nКоротке введення в Javascript / Typescript\nJavaScript (JS) – це високорівнева, динамічна, інтерпретована мова програмування, яка в основному використовується в веб. Для синтаксису та назви автори частково надихались мовою Java, однак це єдине що їх повʼязує. \nЯк альтернативу для розробки можна використовувати Typescript.\nTypeScript (TS) – це надбудова над JavaScript від Microsoft, яка додає статичну типізацію та тим самим полегшує розробку великих додатків. \nTypeScript код компілюється у стандартний JavaScript. \n\nОсновні типи в Javascript\n let x = 10;       // змінна\n const y = \"Hello\" // константа\n var z = true      // старіша форма оголошення змінних\n\n // Типи даних\n let number = 42         // число\n let text = \"JavaScript\" // рядок '' та \"\" взаємозамінні\n let isActive = false    // булеве значення\n let array = [1, 2, 3]   // масив\nМова є максимально спрощеною, крапка з комою є не обовʼязковою. Й мова має всього 8 основних типів, основні з яких стрічки, числа, булеві змінні, масиви та обʼєкти:\nРешта типів це Symbol, Null, Undefined, Bigint\n let x: number = 10\n const y: string = \"Hello\"\n var z: boolean = true\nTypescript дозволяє вказати тип змінних\n\nФункції\n function greet(name) {\n   return \"Привіт, \" + name\n }\n console.log(greet(\"Світ\")) // Виведе Привіт, Світ\n console.log(greet()) // Виведе Привіт, undefined\nФункції починаються з ключового слова function. \nПри виклику можна не передавати всі аргументи, відсутні аргументи будуть мати undefined значення. \nФункції також можна створювати всередині інших функцій.\n const add = function(x, y) {\n   return x + y;\n }\n \n const multiply = (x, y) => x * y;\n const multiply2 = (x, y) => {\n   return x * y;\n }\n\nmultiply(4, 9)\nМожна також створювати анонімні функції:\n\n\n\nАбо альтернативний синтаксис (arrow функція):\n\n(якщо => функція має лише один оператор, то можна не писати return, він повертатиметься автоматично:\n\n\nФункції над масивами\nВ ReactNative ми досить часто використовуватимемо деякі стандартні функції над масивами:\nconst array = [1, 2, 3, 4]\n\n// викликає функцію для кожного елементу масиву:\narray.forEach(item => console.log(item))\n\n// map дозволяє викликати функцію над кожним елементом масиву і повернути результуючий масив\nconst multArray = array.map(item => item * 2)  // [2, 4, 6, 8]\n\n// знаходить перший індекс, для якого функція повертає true\nconst idx = array.findIndex(item => item == 3) // 2\n\n\nОбʼєкти\n let obj = { name: \"John\", age: 30 }\n\n obj.newField = \"new value\"        // додавання нового поля в об'єкт\n obj['newField 2'] = \"new value 2\" // 2 варіант додавання нового поля в об'єкт\n delete obj.age;                   // видалення поля з об'єкта\n\n obj.func = function() {\n   console.log('Hello!');\n }\n \n let lat = 10, long = 27          // скорочена форма для:\n let point = { lat, long }        // { lat: lat, long: long }\nРобота з об’єктами теж досить спрощена, ми можемо створювати обʼєкт за домогою {} і одразу задати поля, можна також динамічно додавати / видяли поля та функції з існуючих об’єктів:\n\nДеструктуруюче присвоювання\n let obj = { name: \"John\", age: 30 }\n\n let { name } = obj // деструктуризація об'єкта\n console.log(name)  // John\n\n let arr = [1, 2, 3, 4]\n let [a, b, c] = arr      // деструктуризація масиву\n\nЩе одна синтаксична конструкція, яку ми будемо використовувати це деструкруризація обʼєктів, іноді ще називається деконструктори. Ми можемо отримати одне / кілька полів об’єкта через присвоювання:\n\nМодульність в Javascript\nJavascript пропонує розбивати великі програми на окремі модулі, однак в Javascript відсутні модифікатори доступу (public, private, …), тому працює це наступним чином:\nconst prefix = 'Object: '\n\nfunction stringify(a) {\n return prefix + JSON.stringify(a);\n}\nexport default stringify;\nimport stringify from './Fun'\n\nconsole.log(stringify({ a: 1, b: 2 }))\n\nFun.js\nApp.js\nВикористовуючи ключове слово export можна експортувати, функції, обʼєкти чи змінні з файлу. \n\nВідповідно в іншому файлі можна їх імпортувати за іменем файлу.\n\nНе експортовані обʼєкти (як prefix) імпортувати не можна й вони \nпо факту є приватними.\n\nМодульність в Javascript\nЙ найбільш поширений \nconst Pi = 3.14159;\nfunction circleArea(radius) {\n    return Pi * radius * radius;\n}\nfunction triangleArea(base, height){\n   return 0.5 * base * height;\n}\n\nexport { Pi, circleArea, triangleArea }\nimport {Pi, circleArea } from './Math'\n\nMath.js\nApp.js\n💡 Якщо import видає помилку компіляції, то можливо необхідно увімкнути їх в package.json додавши “type”: “module”.\n\nАсинхронність\nasync function loadRemoteData(url) {\n const response = await fetch(url)\n\n if (!response.ok) {\n   throw new Error(\"HTTP error: \" + response.status)\n }\n return await response.json()\n}\nJavascript підтримує асинхронні функції, які синтаксично схожі на С#. Наприклад функція читання JSON з серверу може виглядати так:\nОскільки ваш JS код завжди виконується тільки в одному потоці, то більшість функцій, які виконують довготривалі дії в JS є асинхронними.\n\nПререквізити\nДля початку роботи необхідно встановити node.js та npm (система збірки та менеджер пакетів для node). В якості редактора підходить найкраще VS Code.\nМожливо також розробляти додатки в Web за допомогою редактора Snack.\nСтворення нового проекту при встановлених Node / npm:\n\n$ npx create-expo-app --template\n\nВ якості шаблону можна обрати base.\n\nСтруктура додатку React Native\nAssets – набір ресурсів додатку, таких як зображення, шрифти, тощо.\nApp.js – Основний компонент додатку, в якому ми буде наш код\nindex.js – Точка входу в програму, міняти не будемо\napp.js – Налаштування додатку, аналог AndroidManifest.xml\npackage.json – Використовувані бібліотеки, налаштування проекту та збірки (аналог build.gradle)\n\npackage-lock.json – технічний файл з \nконкретними версіями бібліотек\n\nimport React from 'react'\nimport {Text} from 'react-native'\n\nfunction MyComponent() {\n return <Text>Hello</Text>\n}\n\nОснови React / React Native – Component\nБібліотека React організовує додатки в окремі компоненти, компонент по факту є просто функцією, яка повертає шаблон схожий на HTML:\nconst MyComponent = () => {\n  return <Text>Hello</Text>\n}\n\nЧасто можна зустріти варіант з використанням анонімних функцій, однак різниці між цими підходами немає:\nНасправді цей запис не є правильним Javascript синтаксисом – він не дозволяє просто вставляти HTML теги в код. Такий синтаксис називається JSX, й файл обробляється спеціальним пре-процессором який перетворює його в валідний javascript\n\nКомпозиція компонентів\nfunction MyComponent() {\n return <Text>Hello</Text>\n}\n\nfunction App() {\n return (\n  <View>\n   <MyComponent />\n   <Button title=\"Press me\" />\n  </View>\n )\n}\n\nТепер маючи компонент, його можливо вбудувати в додаток, поєднавши з іншими компонентами.\n\nВони мають починатись з великої літери, що вказує react що це компонент (на відміну від звичайного HTML тегу).\n\n\nView, Text, Button власне теж є такими компонентами, які надає React Native.\n\n\nНативні компоненти\nВласне в React Native додатку ви оперуєте компонентами, що надає бібліотека й після компіляції вони трансформуються в нативні компоненти системи:\nТак, наприклад, компонент Text стане:\nTextView на Android\nUITextView на iOS\n\nОрганізація додатку з компонентів\nТобто додаток організовується як набір окремих компонентів, які можуть мати як внутрішній стан так і взаємодіють між собою. Ці компоненти можуть бути як стандартні, отримуватись з безлічі бібліотек (наприклад), так і написані вами як композиція кількох існуючих компонентів.\nUserProfile\nImage\nText\nSeparator\nButton\nButton\nUsersList\nFlatList\nUserListItem\nImage\nText\nVoteButton\nAddButton\n\nJSX синтаксис\nexport default function App() {\n const text = 'Hello world';\n\n return <View>\n   <Text>{text}</Text>\n   <Image source={{\n        uri: 'https://picsum.photos/200/200', \n        width: 200, \n        height: 200\n      }} />\n   <Button title=\"Click me\" \n       onPress={() => alert('Button clicked')} />\n </View>\n}\nСхожий на HTML, однак більш строгий – обовʼязково закривати теги, одиночні також\nНе можна повертати більше 1-го тегу, якщо їх більше – необхідно їх завернути в View (аналог div в HTML) або ж <>.\n{} дозволяє вставляти javascript в шаблон, це можуть бути змінні, функції або ж навіть об’єкти, так source тут це об’єкт з 3 полями uri, width та height (зовнішні дужки означають початок javascript, а внутрішні – об’єкт)\n\nУмови в JSX\nexport default function App() {\n let page = 'main';\n const content = (page === 'main') ? \n       <Text>Main page</Text> : \n       <Text>Other page</Text>\n\n return <View>\n   {content}\n   <Button title=\"Click me\" onPress={() => changePage()} />\n </View>\n}\nМожна присвоювати компоненти в змінні в залежності від умов та використовувати далі в шаблонах:\n\nЦикли в JSX\nexport default function App() {\n let pages = [ 'item 1', 'item 2', 'item 3' ]\n\n return <View>\n   { pages.map (item => <Text>{item}</Text>) }\n </View>\n}\nМожна також організовувати цикли, на основі списків за допомогою методу map, що перетворить кожен елемент списку в текст:\n\nСтилі\nexport default function App() {\n return <SafeAreaView style={styles.container}>\n    <Button title=\"Click me\" style={styles.button} />\n </SafeAreaView>\n}\n\nconst styles = StyleSheet.create({\n container: {\n   backgroundColor: 'white',\n   alignItems: 'center',\n   justifyContent: 'center'\n },\n button: {\n  backgroundColor: 'green',\n }\n});\n\nСтилі є звичайними JS обʼєктами й можуть задаватись через властивість style компонента, яку підтримують більшість компонентів.\n\nНазви стилів схожі на CSS з деякими відмінностями:\n    – css стилі які мали ‘–’ замінено на CamelCase, так background-color став backgroundColor\n    – за замовчуванням в якості одиниць розмірів використовуються DP\n\n\nТакож прийнято виносити стилі в окремий обʼєкт та пропускати його через StyleSheet.create(), яка проводить валідацію стилів.\n\nProps\nВ компоненти можна передавати дані з батьківських компонентів за допомогою властивостей (props), які виглядають як html атрибути:\nfunction MyComponent({name, onPress}) {\n return <Button title={'Hello ' + name} onPress={onPress}/>\n}\n\nexport default function App() {\n return <View>\n   <Text>Hi press the button</Text>\n   <MyComponent name=\"John\" onPress={() => console.log('Button pressed')} />\n </View>\n}\n\nСтан компонентів\nfunction MyComponent({name }) {\n let counter = 0\n return <Button \n       title={'Лічильник зараз: ' + counter} \n       onPress={() => counter = counter + 1} \n />\n}\n\nexport default function App() { \n return <SafeAreaView>\n   <MyComponent />\n </SafeAreaView>\n}\nЯкщо розробити просту програму з лічильником, що змінюватиметься при натисненні, то вона не буде працювати як очікується:\nВідображення так і показуватиме 0, хоча змінна counter змінюється, це відбувається тому, що React не відслідковує зміни в довільних javascript змінних, й необхідно явно вказати, що змінна впливає на відображення\n\nuseState\nimport { useState } from 'react';\n\nfunction MyComponent({name }) {\n let [counter, setCounter] = useState(0)\n return <Button \n   title={'Лічильник зараз: ' + counter} \n   onPress={() => setCounter(counter + 1)} />\n}\n\nexport default function App() { \n return <SafeAreaView>\n   <MyComponent />\n </SafeAreaView>\n}\nФункція useState приймає початковий стан лічильника й повертає масив з 2-х значень:\n\nЗмінна з значенням лічильника\nМетод для зміни лічильника, при використанні якого компонент буде перемальовуватись: \n\nОрганізація спільних даних компонентів\nЯкщо якісь дані мають бути спільними для кількох компонентів, то вони просто виносяться в батьківський компонент:",
      generated: [Object ...],
      created_at: 2025-11-04T13:53:15.910Z,
      updated_at: 2025-11-04T20:32:15.729Z,
      index: 11,
      name: "Кросплатформенна розробка з використанням React native",
    }
  ],
  prerequisites: [],
  postrequisites: [],
  generalResults: [],
  specialResults: [],
  programResults: [],
}